{
  "status": "success",
  "data_source": "time_all",
  "total_posts": 100,
  "posts": [
    {
      "platform": "reddit",
      "post_id": "1nqreow",
      "title": "Some guy in the IoT department almost got fired a couple weeks ago for being late all the time, they just presented this",
      "content": "They're thinking of calling it the Rube Awakening. They tried to reach out to our marketing friends over at r/Damnthatsinteresting but they rejected the project due to being \"not interesting enough\".",
      "author": "TheMaydayMan",
      "timestamp": "2025-09-26 11:54:46",
      "url": "https://reddit.com/r/doohickeycorporation/comments/1nqreow/some_guy_in_the_iot_department_almost_got_fired_a/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "doohickeycorporation",
      "score": 945,
      "num_comments": 36,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nmpslv",
      "title": "Does IoT Still Have a Future for Startups, or Is the Market Already Saturated?",
      "content": "I’ve been thinking a lot about IoT (Internet of Things) and whether it still has a promising future for starting a business. During the COVID-19 era, we saw a wave of IoT companies and products gain traction. Things like temperature sensors, smart health monitors, and gadgets from companies like Xiaomi made it seem like IoT was about to explode. Now it feels like the buzz has died down. We don’t hear much about new smart gadgets anymore. For example, why would anyone still need a temperature sensor? And even if they do, aren’t there already more than enough in the market? So my question is: 1. Do you think IoT is still a viable field for building a business? 2. Or has the market become oversaturated and stagnant? I’d love to hear your thoughts, especially from people in the industry or who follow tech trends closely.",
      "author": "Agreeable-School8499",
      "timestamp": "2025-09-21 19:44:11",
      "url": "https://reddit.com/r/Entrepreneur/comments/1nmpslv/does_iot_still_have_a_future_for_startups_or_is/",
      "metadata": {
        "domain": "self.Entrepreneur",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Entrepreneur",
      "score": 12,
      "num_comments": 24,
      "upvote_ratio": 0.83,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n1dpug",
      "title": "What to focus on in IoT?",
      "content": "Hi, i am a first year college student. My degree is not related directly to IoT but i wanna make a career in IoT. I started IoT 2 days ago. I learned about LEDs, OLED screen, pushbutton, and somewhat about esp32 pins. Today i am learning about dht22 sensor. But, iot is too vast, what should i focus on first? Any theories, laws etc. or should i learn about sensors first? I made a traffic light mini project with three LEDs, a OLED screen and a button. I am currently just studying from datasheets and chatgpt, are there any youtube channels, blogs, communities dedicated to IoT like this sub reddit? Any help is much appreciated.",
      "author": "Turbulent_Let_5878",
      "timestamp": "2025-08-27 18:50:12",
      "url": "https://reddit.com/r/IOT/comments/1n1dpug/what_to_focus_on_in_iot/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 5,
      "num_comments": 22,
      "upvote_ratio": 0.86,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1m6i90m",
      "title": "Career in IoT",
      "content": "Hi. I am looking for some advise for what I should do next in my career. I have a degree in Computer Science and Engineering degree from a state university. Currently, I have been an IoT engineer for my current company for about a year now. Before that, I was an IoT engineer for about 3 years. So, 4 years in total. Before that, I was a backend engineer for about 12 years, which includes the IoT roles. For both of these companies, I have built IoT and backend solutions using an MQTT broker to communicate to and from IoT devices. Plus, any of the other necessary solutions that are required to make those IoT devices work correctly in a production environment. This is where I want some advice in my career. I am currently thinking about going back to school for a Electrical Engineering degree simply because I noticed that I really enjoy working with physical, tangible devices. And mainly, I am just curious about building hardware IoT devices. So I figured why not build the devices themselves since I already have the software background for them? And I've been doing hardware related projects since college. I built drones, esp32 projects, etc. I have always wanted to really understand what goes into building a PCB. So my question is, is this something someone has done? Is this something that would be a good idea? Do companies hire individuals who have both a hardware and software background for IoT or robotics? What do you guys think? Thanks in advance.",
      "author": "n7down",
      "timestamp": "2025-07-23 00:09:54",
      "url": "https://reddit.com/r/IOT/comments/1m6i90m/career_in_iot/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 32,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ja9mfc",
      "title": "Future of IoT ?",
      "content": "I'm currently pursuing 3rd year in [B.tech](http://B.tech) Computer science engineering with specialization in Iot and Automation whichc means , in contrast to core CSE , I learn Embedded systems, Sensors and Actuators, and few more IoT related subjects. Next semester it will be time for our placements and I have, what i find a difficult choice to make: To whether stay true and continue to only go for jobs that involves IoT or choose something mainstream. I love working with IoT , Sensors, Robotics, Cloud and anything that's related to actual hardware and getting my hands dirty. But My seniors and some friends in the industry often say different things about the potential and growth of IoT compared to that of AI , Data Science , etc. Though I'm not the type to go after money first, I'm still compelled to take the decision that can give me a bright future. So.. i want to ask those experienced and working here in this sub about what i should look out for and how i should go about it , as , if i go mainstream, as far as i know, = quick money + more oppurtunities + optional post graduation degree , but if i go with IoT = maybe slow money + less opputunities + i will have to do a PG degree as soon as possible, which is a bit of a financial burden on my family. please help me make this decision, and i would appreciate if you gave me a an idea of what i should master if i do end up choosing IoT as my career. TL;DR: I'm in my 3rd year of [B.Tech](http://B.Tech) in CSE with IoT and Automation specialization and are unsure whether to pursue a career in IoT or opt for mainstream fields like AI or Data Science. I love working with hardware and IoT but am concerned about IoT's growth and earning potential compared to AI and Data Science. While I'm not focused on money, I'm thinking about future opportunities and the need for a post-graduation degree if I do end up going for IoT.",
      "author": "Lukesaura",
      "timestamp": "2025-03-13 19:19:01",
      "url": "https://reddit.com/r/IOT/comments/1ja9mfc/future_of_iot/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 15,
      "num_comments": 36,
      "upvote_ratio": 0.86,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mlhaz8",
      "title": "Should i fully switch to Windows 10 LTSC iOT and is it perfectly fine for GAMING?",
      "content": "So uhm i heard about ltsc before some months and today i suddeny thought about it, why not switch to such a debloated lightweight operating system and its windows 10 too! I was just curious and worried if most of the famous multiplayer games works with it cause it has anticheat and all that stuff, please let me know! For example: apex legends. Also i use vmware workstation so i wanna know if that works too. I'll send a screenshot of my desktop that has all the games in it. Dont be shocked 😂😂 (i always hide the desktop icons haha)",
      "author": "NexusBexusV2",
      "timestamp": "2025-08-09 13:11:53",
      "url": "https://reddit.com/r/WindowsLTSC/comments/1mlhaz8/should_i_fully_switch_to_windows_10_ltsc_iot_and/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "WindowsLTSC",
      "score": 0,
      "num_comments": 20,
      "upvote_ratio": 0.41,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1lkv7lf",
      "title": "FBI Warning on IoT Devices: How to Tell If You Are Impacted",
      "content": "",
      "author": "a_Ninja_b0y",
      "timestamp": "2025-06-26 16:55:23",
      "url": "https://reddit.com/r/technology/comments/1lkv7lf/fbi_warning_on_iot_devices_how_to_tell_if_you_are/",
      "metadata": {
        "domain": "eff.org",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "technology",
      "score": 959,
      "num_comments": 121,
      "upvote_ratio": 0.96,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1kovz3k",
      "title": "Why is it still so hard to scale IoT in the real world?",
      "content": "Every time I think our clients have mastered the combination of reliable device, decent firmware, cloud dashboard, and \"global\" SIM, something else breaks. * One batch of devices struggles with OTA updates. * Another gets stuck roaming in dead zones. * Client chooses 4G in a region with 2G only. * And everyone in the value chain (device guys, firmware folks, cloud devs, SIM providers) blames someone else. Honestly, it feels like IoT is just broken sometimes. Each part might work great on its own, but the minute you scale across 1,000+ devices in multiple locations, it’s chaos. I'm just curious how others here are managing. I'm not here to rant; I just want to learn from others who are fighting the same battle. I would love to hear what’s working (or not) in your world.",
      "author": "FitRecommendation434",
      "timestamp": "2025-05-17 23:42:47",
      "url": "https://reddit.com/r/IOT/comments/1kovz3k/why_is_it_still_so_hard_to_scale_iot_in_the_real/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 14,
      "num_comments": 31,
      "upvote_ratio": 0.94,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nbns6z",
      "title": "Windows 11 IoT Enterprise LTSC 25H2",
      "content": "",
      "author": "m0rn1ngv13w",
      "timestamp": "2025-09-08 21:29:42",
      "url": "https://reddit.com/r/WindowsLTSC/comments/1nbns6z/windows_11_iot_enterprise_ltsc_25h2/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "WindowsLTSC",
      "score": 95,
      "num_comments": 32,
      "upvote_ratio": 0.93,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mzkwzw",
      "title": "Can I create an IoT wireless network from Guest?",
      "content": "I don't need a Guest WI-FI, can I simply connect all my IoT devices to it and then change some parameter on the firewall (Luci) to make it an IoT network? Do I have to go the VLAN route? Can anyone help with this?",
      "author": "ShiftRepulsive7661",
      "timestamp": "2025-08-25 16:29:17",
      "url": "https://reddit.com/r/GlInet/comments/1mzkwzw/can_i_create_an_iot_wireless_network_from_guest/",
      "metadata": {
        "domain": "self.GlInet",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "GlInet",
      "score": 0,
      "num_comments": 12,
      "upvote_ratio": 0.5,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ncgg9x",
      "title": "TIL a group of hackers managed to hack into a casinos' database of high rollers through the IoT enabled thermostat in the casinos' fish tank.",
      "content": "",
      "author": "zahrul3",
      "timestamp": "2025-09-09 19:36:17",
      "url": "https://reddit.com/r/todayilearned/comments/1ncgg9x/til_a_group_of_hackers_managed_to_hack_into_a/",
      "metadata": {
        "domain": "thehackernews.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "todayilearned",
      "score": 17577,
      "num_comments": 482,
      "upvote_ratio": 0.98,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "10kc6ff",
      "title": "Half of smart appliances remain disconnected from Internet, makers lament | Did users change their Wi-Fi password, or did they see the nature of IoT privacy?",
      "content": "",
      "author": "chrisdh79",
      "timestamp": "2023-01-25 02:22:13",
      "url": "https://reddit.com/r/gadgets/comments/10kc6ff/half_of_smart_appliances_remain_disconnected_from/",
      "metadata": {
        "domain": "arstechnica.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "gadgets",
      "score": 19755,
      "num_comments": 2972,
      "upvote_ratio": 0.95,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "q73uax",
      "title": "High schooler rickrolled entire school by hacking into IoT system",
      "content": "",
      "author": "Merz_Nation",
      "timestamp": "2021-10-13 12:50:30",
      "url": "https://reddit.com/r/nextfuckinglevel/comments/q73uax/high_schooler_rickrolled_entire_school_by_hacking/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "nextfuckinglevel",
      "score": 117057,
      "num_comments": 1911,
      "upvote_ratio": 0.89,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "mecygz",
      "title": "5G as a wireless power grid: Unknowingly, the architects of 5G have created a wireless power grid capable of powering devices at ranges far exceeding the capabilities of any existing technologies. Researchers propose a solution using Rotman lens that could power IoT devices.",
      "content": "",
      "author": "mvea",
      "timestamp": "2021-03-27 20:36:10",
      "url": "https://reddit.com/r/science/comments/mecygz/5g_as_a_wireless_power_grid_unknowingly_the/",
      "metadata": {
        "domain": "nature.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "science",
      "score": 39241,
      "num_comments": 1610,
      "upvote_ratio": 0.91,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1g3jck9",
      "title": "Pirating windows iot enterprise LSTC is even better than pirating windows itself.",
      "content": "It's an official debloated version of windows that has security support for 10 years. I just knew about it now.",
      "author": "jaffer2003sadiq",
      "timestamp": "2024-10-15 00:02:33",
      "url": "https://reddit.com/r/Piracy/comments/1g3jck9/pirating_windows_iot_enterprise_lstc_is_even/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Piracy",
      "score": 1655,
      "num_comments": 322,
      "upvote_ratio": 0.98,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "mvlc18",
      "title": "Samsung's New Upcycling Program Allows You To Turn an Old Galaxy Phone Into a New IoT Device",
      "content": "",
      "author": "thebelsnickle1991",
      "timestamp": "2021-04-22 01:55:36",
      "url": "https://reddit.com/r/gadgets/comments/mvlc18/samsungs_new_upcycling_program_allows_you_to_turn/",
      "metadata": {
        "domain": "gizmodo.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "gadgets",
      "score": 7142,
      "num_comments": 528,
      "upvote_ratio": 0.95,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "mef89g",
      "title": "We are cybersecurity researchers who wrote a book teaching people how to hack the Internet of Things, called Practical IoT Hacking. Ask us anything!",
      "content": "Hello, Reddit! We are cybersecurity researchers who wrote a book called [Practical IoT Hacking](https://practical-iot-hacking.com) that teaches readers how to hack Internet of Things devices safely and lawfully, with practical hands on examples and proven methodologies. You can buy physical and Kindle copies through [Amazon](https://www.amazon.com/Practical-IoT-Hacking-Fotios-Chantzis/dp/1718500904) or get the physical copy and DRM-free digital copy through the publisher [No Starch Press](https://nostarch.com/practical-iot-hacking). We have spent our careers addressing critical issues in IoT devices that could lead to loss of life or privacy breaches. Our work has influenced people around the world, including manufacturers, hospitals, and public policymakers. We believe that enabling more people to find unforeseen risks in a safe manner and report them in good faith can inoculate against accidents and adversaries causing harm. So we wrote a book to teach others who want to be a part of the solution. We believe that societal dependence on connected technology is growing faster than our ability to secure it. As we adopt technology stacks in the works around us, we inadvertently import cybersecurity risks that can impact human life, public safety, and national security. By understanding the threat and vulnerability components of these risks, we can defend against them. Mature manufacturers seek to learn from cybersecurity researchers and take reports of flaws they discover - so they can eliminate them in current and future products. Ask us anything about some of our past work: * [Hack medical devices to save patient lives](https://slate.com/technology/2016/01/malware-not-malicious-hackers-is-the-biggest-danger-to-internet-connected-medical-devices.html) * Contribute to founding [I Am The Cavalry](https://iamthecavalry.org), a global grassroots initiative at the intersection of cybersecurity and public safety * Write a [Hippocratic Oath for Connected Medical Devices](https://iamthecavalry.org/oath/) * Organize hands on educational events on IoT security, such as those for [Healthcare](https://villageb.io), [Industrial Controls Systems (ICS)](https://icsvillage.com), [Aerospace](https://aerospacevillage.com), and [Maritime](https://hackthesea.org) * [Host members of Congress](https://twitter.com/ayanmislam/status/891809706859126785?s=20) at [DEF CON](https://defcon.org), the world’s largest hacker conference * Inspire an [IoT security law](https://www.congress.gov/bill/116th-congress/house-bill/1668) * Develop and maintain the [nmap ncrack](https://github.com/nmap/ncrack) tool * Led a [Google Summer of Code](https://owasp.org/www-community/initiatives/gsoc/gsoc2019ideas) project to develop the [OWASP IoT Goat](https://github.com/OWASP/IoTGoat) * Wrote [three books on the nmap network scanning tool](https://www.amazon.com/Paulino-Calderon-Pale/e/B00LDZQJWE/ref=dp_byline_cont_pop_book_1) * Helped develop [coordinated vulnerability disclosure frameworks](https://disclose.io/) to allow security researchers to report security issues in good faith * Past presentations on IoT devices hacking ([https://census-labs.com/news/2019/05/31/hitting-the-gym-the-anatomy-of-a-killer-workout-troopers-2019/](https://census-labs.com/news/2019/05/31/hitting-the-gym-the-anatomy-of-a-killer-workout-troopers-2019/)) Proof we are authors of the book - [No Starch Press](https://nostarch.com/practical-iot-hacking) [Amazon](https://www.amazon.com/Practical-IoT-Hacking-Fotios-Chantzis/dp/1718500904) * Fotis Chantzis [Bio](https://sock-raw.org/FotisChantzis.pdf) (PDF) [Proof](https://twitter.com/ithilgore/status/1374796727258017793) * [Ioannis Stais](https://www.reddit.com/user/_ioannis_) [Bio](https://www.linkedin.com/in/stais/) [Proof](https://twitter.com/Einstais/status/1375813047776899077) * [Beau Woods](https://reddit.com/u/beauwoods) [Bio](https://beauwoods.com) [Proof](https://twitter.com/beauwoods/status/1374874492879704065?s=21)",
      "author": "beauwoods",
      "timestamp": "2021-03-27 22:50:10",
      "url": "https://reddit.com/r/IAmA/comments/mef89g/we_are_cybersecurity_researchers_who_wrote_a_book/",
      "metadata": {
        "domain": "self.IAmA",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IAmA",
      "score": 4815,
      "num_comments": 441,
      "upvote_ratio": 0.94,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "wsf0xy",
      "title": "Rainforest Connection uses Swarm’s IoT satellite constellation network to connect simple acoustic sensors deployed in the Brazilian rainforest, the sensor hears a chainsaw, and then calls in the people that will stop the deforestation",
      "content": "",
      "author": "readball",
      "timestamp": "2022-08-19 22:11:20",
      "url": "https://reddit.com/r/Futurology/comments/wsf0xy/rainforest_connection_uses_swarms_iot_satellite/",
      "metadata": {
        "domain": "techcrunch.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Futurology",
      "score": 9394,
      "num_comments": 148,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1lxpj53",
      "title": "Belkin shows tech firms getting too comfortable with bricking customers’ stuff | There's no easy alternative, and IoT customers are paying the price",
      "content": "",
      "author": "Hrmbee",
      "timestamp": "2025-07-12 10:38:14",
      "url": "https://reddit.com/r/technology/comments/1lxpj53/belkin_shows_tech_firms_getting_too_comfortable/",
      "metadata": {
        "domain": "arstechnica.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "technology",
      "score": 966,
      "num_comments": 92,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "nyyq9f",
      "title": "Blackberry UNDER-Valuation..leader in EV, iot, and security",
      "content": "&amp;#x200B; [Market Cap Comparison Analysis](https://preview.redd.it/4r63qrcvt1571.png?width=971&amp;format=png&amp;auto=webp&amp;s=2d4f9a72344e72b286cf493750b9773dc16d8af5) [BB NSA Certified Proof](https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/blackberry-achieves-nsa-approval-for-blackberry-uem) [Blackberry Department of Info Network Certification](https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/blackberry-achieves-department-of-defense-information-network-dodin-approval-for-blackberry-uem) [BB protect-ED against ransomware 5 years before it was developed proof](https://blogs.blackberry.com/en/2021/05/blackberry-prevents-darkside-ransomware-years-before-it-ever-existed) [BB Secure Software in 175 million cars on road](https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/blackberry-qnx-software-now-embedded-in-more-than-175-million-vehicles) [BB software in 70% of EV cars (23/25) top EV OEM](https://blackberry.qnx.com/en/forms/wp-why-blackberry-qnx-has-become-the-leading-ev-software-supplier) **summary for APES**: Blackberry is undervalued by 10x.....it's a leader in cybersec for iot and cars. The BB QNX is the only certified software running on connected and autonomous cars (70% of market)... [here is proof](https://www.prnewswire.com/news-releases/blackberry-qnx-adds-another-certification-to-its-embedded-software-portfolio-301165498.html) As you can see there is something going on with blackberry stock. Based on this comparison analysis it's a **massively undervalued** company that's leading charge in EV, iot, connected cars, ai cybersecurity. Rest of these companies only provide a small component of Unified Endpoint Security (UES), only Blackberry provides all components you need for **UES (next gen security architecture)!**! Meaning, an enterprise or government only needs to use a single platform **blackberry spark** to enable UES across their network of iot (computer, laptop, servers, phones, drones, cars, etc). The other companies only provide small part of UES, so it's more expensive for enterprise to go with other companies because then they have to deal with multiple companies to enable UES. Example, crowdstrike only provides Cybersecurity and does not provide Unified Endpoint Management (UEM) or Car operating system. **To enabled smart and connected future you need UES, UEM, Car Operating system and ai security and only blackberry has all these under a single platform!!!!** **Blackberry Spark has UES and UEM**. No other companies listed in this table provides both solution. Blackberry leads in car security and operating system...none of these other companies have car software. Blackbery owns 70% of ai cybersecurity patents and has the most advanced and mature machine learning model. the model prevents cyber attacks before they happen...meaning it prevents the attack from executing!! All together blackberry has **40,000 patents**!! So at this moment the company's leadership in EV and iot and cybersecurity should value it around 70-80 Billion or at MINIMUM $140 a stock!! This is just my analysis and DD. Please invest after doing your own DD. This is not a financial advice. **Wish you all apes Godspeed**!!! you all have found a true diamond!!",
      "author": "ModernBuddha1",
      "timestamp": "2021-06-13 23:27:36",
      "url": "https://reddit.com/r/wallstreetbets/comments/nyyq9f/blackberry_undervaluationleader_in_ev_iot_and/",
      "metadata": {
        "domain": "self.wallstreetbets",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "wallstreetbets",
      "score": 2246,
      "num_comments": 527,
      "upvote_ratio": 0.87,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "qge280",
      "title": "Recently I broke off my IoT traffic and I want to share my new network setup.",
      "content": "",
      "author": "Ashkaan4",
      "timestamp": "2021-10-27 03:24:58",
      "url": "https://reddit.com/r/homelab/comments/qge280/recently_i_broke_off_my_iot_traffic_and_i_want_to/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homelab",
      "score": 2582,
      "num_comments": 347,
      "upvote_ratio": 0.98,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "13xg30w",
      "title": "Amazon Ring IoT epic fail",
      "content": "[https://www.ftc.gov/system/files/ftc\\_gov/pdf/complaint\\_ring.pdf](https://www.ftc.gov/system/files/ftc_gov/pdf/complaint_ring.pdf) &amp;#x200B; \"Not only could every Ring employee and Ukraine-based third-party contractor access every customer’s videos (all of which were stored unencrypted on Ring’s network), but they could also readily download any customer’s videos and then view, share, or disclose those videos at will\" \"Although an engineer working on Ring’s floodlight camera might need access to some video data from outdoor devices, that engineer had unrestricted access to footage of the inside of customers’ bedrooms.” &amp;#x200B; “Several women lying in bed heard hackers curse at them,” and “several children were the objects of hackers’ racist slurs.” The complaint details even nastier attacks – skip pages 13 and 14 to avoid references to incidents of a sexual nature.",
      "author": "Ochib",
      "timestamp": "2023-06-01 20:18:56",
      "url": "https://reddit.com/r/sysadmin/comments/13xg30w/amazon_ring_iot_epic_fail/",
      "metadata": {
        "domain": "self.sysadmin",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "sysadmin",
      "score": 1243,
      "num_comments": 397,
      "upvote_ratio": 0.96,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ixxews",
      "title": "I coded IoT controller app for my Garmin.",
      "content": "",
      "author": "jakubweg",
      "timestamp": "2025-02-25 23:19:33",
      "url": "https://reddit.com/r/Garmin/comments/1ixxews/i_coded_iot_controller_app_for_my_garmin/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Garmin",
      "score": 1838,
      "num_comments": 66,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1lppl52",
      "title": "Spent thousands on UniFi gear — support says my IoT devices are overloading the APs? Is this reasonable?",
      "content": "Hey all, I’ve invested heavily in UniFi gear for my single-family home — well over €3,000 into a near-pro-level setup: * 5 access points (U6 LR, U6 Mesh, U7 Outdoor) * Dream Machine Pro * PoE Pro switches * All connected via CAT6e, fully wired, all defaults (no weird config) Recently I’ve been having terrible WiFi issues. Packet loss, unstable throughput, massive variability on speed tests. Ethernet is flawless (900 Mbps+), but WiFi just breaks randomly — even 3m from a ceiling-mounted AP. I contacted UniFi support, ran all the diagnostics, sent them logs, Airtime scans, etc. Then I received this explanation: &gt;“We reviewed the support file and observed high channel utilization on multiple access points: &gt;U6 LR (5GHz): 17 IoT devices connected — suggested to redistribute them &gt;U7 Outdoor (2.4GHz): high utilization &gt;U6 Mesh (2.4GHz): 14 IoT devices &gt;U6 LR (2.4GHz): 15 IoT devices” Then they told me to \"balance the load across APs and channels\" to reduce interference... **My question to the community:** How is it that a few dozen **tiny IoT devices**, most of which send a few bytes of data now and then, can *congest* APs that — per UniFi’s own specs — are rated to handle **250–400+ clients** each? This isn’t an apartment building. It’s one house with some smart plugs, HomeKit sensors, and a couple phones and laptops. If this is enough to crash or choke the system, is something seriously wrong with the firmware/configuration? Or are UniFi APs just massively over-advertised? Has anyone else run into this or am I missing something obvious? Appreciate any real-world advice or input. I really want to love this system, but right now it feels like I’m fighting it more than using it. **Edit:** Thanks for all the great input — seriously one of the most helpful threads I’ve posted. To summarize some common themes I’ve seen (and replied to) that might help others: 1. Here are some **screenshots** I've been uploading in this thread [https://imgur.com/a/mctynBs](https://imgur.com/a/mctynBs) 2. **I do have a separate SSID and VLAN for IoT** — 2.4 GHz-only, WPA2, isolated IP range. I’ve repeated this a few times in comments because people kept missing it 😅 3. **No 6 GHz support in my setup** — None of my APs (U6 LR, U6 Mesh, U7 Outdoor) have 6 GHz radios. Some advice around 6 GHz didn’t apply here, but it’s good context for others reading. 4. **Multicast storm from a robot lawnmower** — turned out to be a major clue. One AP showed nearly 100% multicast utilization 24/7. So yes, chatty devices can saturate airtime even if they don’t use much actual data. 5. **Meshing was silently enabled** — even though all APs are wired. I’ve now disabled the \"Meshing Parent\" and \"Connect\" settings, as suggested. 6. **Channel width and DFS:** I’ve switched to 20 MHz on 2.4 GHz and am experimenting with 80 MHz on 5 GHz. I’ve also enabled DFS channels after multiple people pointed out they’re safe and useful in residential setups. 7. **TX Power and RSSI:** Still tweaking these — not rushing changes blindly without proper tools, but planning to reduce TX power and possibly add min RSSI thresholds to prevent sticky client issues. 8. **Some AP models are problematic:** A few people called out the U6 LR specifically as having issues with mDNS and client stability — not something I expected, but worth testing. Again, big thanks to everyone contributing. I’m continuing to test and update config, and I’ll report back if I find anything breakthrough-level. 🎉🎉 **Edit:** **I think we found the solution** 🎉🎉 Details here: [https://www.reddit.com/r/Ubiquiti/comments/1lppl52/comment/n0zhyki/?utm\\_source=share&amp;utm\\_medium=web3x&amp;utm\\_name=web3xcss&amp;utm\\_term=1&amp;utm\\_content=share\\_button](https://www.reddit.com/r/Ubiquiti/comments/1lppl52/comment/n0zhyki/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) 🎉🎉 **Final Edit: Confirmed — It Was mDNS** 🎉🎉 After nearly 24 hours of additional testing, I can now confirm with 100% certainty that **mDNS was the root cause** of my issues. I toggled mDNS proxying on and off multiple times, and the difference was night and day — no doubt left. I have around **60 ESPHome devices**, which appear to be broadcasting constantly (note to self: check mDNS interval settings in firmware). Combine that with several **Apple devices** (Bonjour/mDNS-heavy), and it’s no surprise the symptoms were worst there. Only the **U7 Outdoor** gives visibility into multicast utilization via the *Radios &gt; Airtime* graph — and it showed nearly **100% multicast airtime**. The U6 series doesn’t expose this stat, but the U7 was clearly the canary: dropped pings, jittery latency (see [screenshot](https://imgur.com/o7NRSr8)), and general instability. If you’ve got **60–70 devices** (TVs, Sonos, ESPHome, etc.) blasting mDNS — and UniFi APs are trying to **proxy that traffic between Main, IoT, and Guest VLANs** — it can *absolutely* overwhelm the system. I still want to retain some level of discovery across VLANs (e.g., casting, automation), but with **rate limiting or filtering**. My next step is to try deploying an **mDNS proxy in Docker** on my Synology NAS. It has dual Ethernet, so I’ll bridge it to both VLANs and control things more surgically. Massive thanks again to everyone who contributed — this thread has been invaluable. Good luck to others debugging their setups — and **don’t overlook mDNS**. It can *wreck* your network silently.",
      "author": "stoprocentdoc",
      "timestamp": "2025-07-02 15:24:59",
      "url": "https://reddit.com/r/Ubiquiti/comments/1lppl52/spent_thousands_on_unifi_gear_support_says_my_iot/",
      "metadata": {
        "domain": "self.Ubiquiti",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Ubiquiti",
      "score": 385,
      "num_comments": 172,
      "upvote_ratio": 0.93,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1br1rif",
      "title": "How will they know what is being said in private homes? Your Smart TV, Smart Phone, Smart Watch, Smart Fridge and all the other IoT devices. We've literally brought their weapons into our own homes and now they're about to turn them on us.",
      "content": "",
      "author": "UniversalSurvivalist",
      "timestamp": "2024-03-30 06:42:45",
      "url": "https://reddit.com/r/conspiracy/comments/1br1rif/how_will_they_know_what_is_being_said_in_private/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "conspiracy",
      "score": 826,
      "num_comments": 324,
      "upvote_ratio": 0.91,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "tuj33a",
      "title": "4 years ago Loopring replied to Elon suggesting he do an ICO to buy back Tesla, and use the coins for IOT payments in the Tesla Ecosystem 💡 Think of the LRC x GME possibilities",
      "content": "",
      "author": "BananyaBangarang",
      "timestamp": "2022-04-02 21:39:09",
      "url": "https://reddit.com/r/Superstonk/comments/tuj33a/4_years_ago_loopring_replied_to_elon_suggesting/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Superstonk",
      "score": 5393,
      "num_comments": 124,
      "upvote_ratio": 0.98,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "xbmrup",
      "title": "Researchers discover a new strain of Linux malware called Shikitega that infects servers and IoT devices with stealth and sophistication, making detection tough",
      "content": "",
      "author": "lemon_bottle",
      "timestamp": "2022-09-12 00:23:11",
      "url": "https://reddit.com/r/programming/comments/xbmrup/researchers_discover_a_new_strain_of_linux/",
      "metadata": {
        "domain": "arstechnica.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "programming",
      "score": 1832,
      "num_comments": 207,
      "upvote_ratio": 0.95,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "152ypf1",
      "title": "The US government wants to label secure IoT devices with a 'Cyber Trust Mark' | It could label qualifying items like smart fridges and routers.",
      "content": "",
      "author": "chrisdh79",
      "timestamp": "2023-07-18 21:36:30",
      "url": "https://reddit.com/r/technews/comments/152ypf1/the_us_government_wants_to_label_secure_iot/",
      "metadata": {
        "domain": "engadget.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "technews",
      "score": 1788,
      "num_comments": 141,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "o7slgi",
      "title": "When Sensors, IoT and Augmented Reality merges to make avatars dance... A stunning show emerges!",
      "content": "",
      "author": "Narendra_17",
      "timestamp": "2021-06-26 01:40:53",
      "url": "https://reddit.com/r/nextfuckinglevel/comments/o7slgi/when_sensors_iot_and_augmented_reality_merges_to/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "nextfuckinglevel",
      "score": 4872,
      "num_comments": 118,
      "upvote_ratio": 0.96,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mdxtek",
      "title": "Acquisition sends thousands of Whistle pet trackers to IoT graveyard",
      "content": "",
      "author": "diacewrb",
      "timestamp": "2025-07-31 18:21:26",
      "url": "https://reddit.com/r/gadgets/comments/1mdxtek/acquisition_sends_thousands_of_whistle_pet/",
      "metadata": {
        "domain": "arstechnica.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "gadgets",
      "score": 636,
      "num_comments": 60,
      "upvote_ratio": 0.95,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mlbdg0",
      "title": "Do you put all your iOT devices on a Vlan?",
      "content": "Along with your HA I assume. I currently have 61 devices on my LAN, all working from the main LAN. I use strictly Omada devices. Is it worth it to move all the devices to a vlan? Is the only benefit to stop devices from calling home?",
      "author": "TheBigC",
      "timestamp": "2025-08-09 08:11:42",
      "url": "https://reddit.com/r/homeassistant/comments/1mlbdg0/do_you_put_all_your_iot_devices_on_a_vlan/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 127,
      "num_comments": 155,
      "upvote_ratio": 0.93,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ixofeu",
      "title": "Selamat Siang Komodos. Saat ini saya sedang membuat Start Up baru terkait teknologi pemupukan padi otomatis menggunakan IOT. Mohon masukan dan sarannya. Terima kasih :).",
      "content": "",
      "author": "najwascihub",
      "timestamp": "2025-02-25 14:18:17",
      "url": "https://reddit.com/r/indonesia/comments/1ixofeu/selamat_siang_komodos_saat_ini_saya_sedang/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "indonesia",
      "score": 389,
      "num_comments": 139,
      "upvote_ratio": 0.96,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1h32e71",
      "title": "U7 series APs 2.4ghz IoT issues updates, the clock is ticking (for some)",
      "content": "EDIT 6 Months later: I think it's fair to say these issue are resolved. If you still have issues, be sure to comment on the firmware releases in the Ubiquiti forums. I personally have switched to U7 XG models as the thermal design is much better. I no longer have any IoT issue (though i still never went back to Matter over WiFi). Original post: Wanted to collect a few items together for the benefit of everyone following along. Recap for those that need it: the U7 Pro and Pro Max have issues with 2.4Ghz IoT devices. The majority report devices 'ghost dropping' where they show in the controller, show as associated but don't pass any data. I found issues with the Matter protocol creating too much mDNS traffic that overloads (as in 100% channel utilization the AP, multi-second ping times) the AP, but the same system with a gen 5,6 AP won't show past 20% and won't have any issues. I recently downgraded all my light switches back to Homekit which solves that issue with less mDNS, but now i have what everyone else reports, the ghost dropping. u/digiblur has been able to [create a repeatable lab demonstration of the issue](https://community.ui.com/releases/UniFi-Access-Point-7-0-84/afbef858-2eac-41e7-a405-1d036ce379a1#comment/bd335a6c-d937-4d46-ad03-35becb044050) with 33 smart plugs. I can't say this enough, this is **not a configuration issue**, this is **not a user issue**. If the U7 works for you and your IoT, great. But there is a measurable amount of people it doesn't work for. Please don't try and tell us what we should be doing. In fact Ubiquiti tried adding a \"enhanced IoT mode\" in EA Network that forced all the settings we all knew we should be using to begin with. Didn't solve the issue. The last EA version has asked us to[ not use that mode anymore](https://community.ui.com/releases/UniFi-Access-Point-7-0-84/afbef858-2eac-41e7-a405-1d036ce379a1). At least for that build. Ubiquiti created [a thread to collect email address of those affected](https://community.ui.com/questions/U7-and-2-4GHz-IoT-devices/a8cbd7bc-0001-44cc-bd89-91c0313cf4e9) for working in email with customers on bug fixes. It has 125 comments. We have seen 10 EA versions released since that thread was made on the 7.0.x branch, none really fix the issue. Each release has 5-10 pages of comments of people all about this IoT issue. Ubiquiti has said [they have all their focus on fixing this](https://community.ui.com/releases/UniFi-Access-Point-7-0-84/afbef858-2eac-41e7-a405-1d036ce379a1#comment/c1114113-cd30-439f-bfd7-45601bfd600e) and implied this delays the 7.1 branch development (MLO and ZWDFS). At least that's what i take from the comment, but it's linked for you to read. Because i have (had) a special issue with having 50+ Matter products causing a IPv6 mDNS storm i did have direct contact with Ubiquiti for a bit through email They sent me some special builds and I sent them Wireshark 802.11 captures. No real fix and they haven't had me test anything since Oct 16th. I don't post this to bash on Ubiquiti (but i also think there is room for improvement) but to educated users and customers on the \"state of affairs\" with this access point generation by collating data that's spread over multiple forum posts and comments. The deeper issue now is we are about a month away from the year anniversary of the U7pro release. Anyone who has purchased a U7 from a distributor (or Amazon) only gets 1 year of warranty. That's about to happen. I would like to see Ubiquiti acknowledge the issues in the U7pro and U7pro max by extending everyones warranty to 2 years (like anyone who bought directly from the UI store already has). That would be a good show of faith in my opinion. Second, a no question asked exchange for a U6Pro would be nice as well for [those of us tired of waiting.](https://www.reddit.com/r/Ubiquiti/comments/1h32e71/comment/lznql2s/) In the mean time, I (we) are left with wives getting ever more frustrated when Alexa can't turn off the light, which happens alot with these APs. EDIT: Several people have reported their U7 InWall have the same issues for those asking.",
      "author": "madsci1016",
      "timestamp": "2024-11-30 10:27:30",
      "url": "https://reddit.com/r/Ubiquiti/comments/1h32e71/u7_series_aps_24ghz_iot_issues_updates_the_clock/",
      "metadata": {
        "domain": "self.Ubiquiti",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Ubiquiti",
      "score": 288,
      "num_comments": 232,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1klrw3l",
      "title": "Do you all split your WIFI? 2.4-5-IOT?",
      "content": "busy advise wine cats dependent grandiose pot adjoining humor repeat *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "author": "InkyBlacks",
      "timestamp": "2025-05-14 01:27:41",
      "url": "https://reddit.com/r/Ubiquiti/comments/1klrw3l/do_you_all_split_your_wifi_245iot/",
      "metadata": {
        "domain": "self.Ubiquiti",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Ubiquiti",
      "score": 125,
      "num_comments": 212,
      "upvote_ratio": 0.93,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "q6kc8t",
      "title": "IoT Hacking and Rickrolling My High School District",
      "content": "",
      "author": "BIG_BUTT_SLUT_69420",
      "timestamp": "2021-10-12 19:47:05",
      "url": "https://reddit.com/r/programming/comments/q6kc8t/iot_hacking_and_rickrolling_my_high_school/",
      "metadata": {
        "domain": "whitehoodhacker.net",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "programming",
      "score": 2018,
      "num_comments": 159,
      "upvote_ratio": 0.94,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1fkjwd6",
      "title": "Massive China-state IoT botnet went undetected for four years—until now",
      "content": "",
      "author": "AdSpecialist6598",
      "timestamp": "2024-09-19 20:43:13",
      "url": "https://reddit.com/r/technology/comments/1fkjwd6/massive_chinastate_iot_botnet_went_undetected_for/",
      "metadata": {
        "domain": "arstechnica.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "technology",
      "score": 876,
      "num_comments": 76,
      "upvote_ratio": 0.94,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n3zll6",
      "title": "Are you putting your devices on your IoT network or trusted network?",
      "content": "I’m curious to know how people are segmenting their wifi networks with HA. Generally speaking, it’s my understanding that IoT devices should be separated out onto a separate wifi network from your trusted devices, but I’m coming across conflicting information when it comes to where HA should land? Are you putting your HA hub (e.g. HA yellow, HAOS on a minipc, etc) on your trusted network or on your IoT network? If you place it on your trusted network, how are you connecting your IoT devices — trusted or IoT network?",
      "author": "infoaddict2884",
      "timestamp": "2025-08-30 19:47:57",
      "url": "https://reddit.com/r/homeassistant/comments/1n3zll6/are_you_putting_your_devices_on_your_iot_network/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 56,
      "num_comments": 110,
      "upvote_ratio": 0.94,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1m36pp2",
      "title": "I love ltsc iot",
      "content": "LTSC IOT has support till 2032 and its stripped down with no bloatware and I'm considering edge as my default browser ngl its probably the best version of windows 10",
      "author": "Automatic_Shock_4557",
      "timestamp": "2025-07-19 00:20:14",
      "url": "https://reddit.com/r/WindowsLTSC/comments/1m36pp2/i_love_ltsc_iot/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "WindowsLTSC",
      "score": 139,
      "num_comments": 88,
      "upvote_ratio": 0.94,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "17ke8qo",
      "title": "JioKrishi agri IoT device",
      "content": "",
      "author": "kuzutrash7",
      "timestamp": "2023-10-31 13:57:09",
      "url": "https://reddit.com/r/IndiaTech/comments/17ke8qo/jiokrishi_agri_iot_device/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IndiaTech",
      "score": 1301,
      "num_comments": 64,
      "upvote_ratio": 0.96,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1kpfs14",
      "title": "I wonder...is iot safe to sit on it?",
      "content": "Everyday I'm amazed about the weird discoveries you make in FO4",
      "author": "Grendizer73",
      "timestamp": "2025-05-18 17:11:41",
      "url": "https://reddit.com/r/fo4/comments/1kpfs14/i_wonderis_iot_safe_to_sit_on_it/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "fo4",
      "score": 459,
      "num_comments": 43,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1kflw8a",
      "title": "At what point is it okay to EOL an IoT device?",
      "content": "I’m a Monday-at-work WAN listener, and just heard Linus and Luke’s (negative) opinion on the early Nest thermostats going EOL. I found their opinion a little surprising, especially after it was revealed that the EOL’d thermostats didn’t support modern cryptographic cyphers. I can’t find any source for what that exactly means, but that makes it sound like Google is doing something responsible, and I think there’s room for a more nuanced discussion about it. I suspect the fallout from the move they made was *substantially* less than the potential fallout from continuing to support devices that they KNEW were insecure until several high-severity CVEs (for example) were suddenly discovered and disclosed. My analogy isn’t perfect, but I think it’s kind of similar to if Nintendo still supported WFC on the DS today. It sucks that you can’t play online on the DS anymore, BUT the DS also doesn’t support any WiFi authentication protocol better than WEP. Giving customers any reason to run a WEP-“secured” WiFi network was already pretty irresponsible by 2014 (when WFC was turned off). I also think there’s a general understanding that there eventually comes a point where a computer becomes too old to safely use or connect to your home network. I don’t remember IoT marketing ever acknowledging that, but all those devices are fundamentally little baby “computers” (with many fewer functions) that have to interface with other software/hardware, that inevitably will develop security practices that are outside the scope of those old IoT devices. Obviously Google/pre-acquisition Nest didn’t have a crystal ball to see those changes ahead of time, so there *is* a point in time where they’re off the hook. When is that? Is 14 years not enough? Would this have been okay if they open-sourced the firmware for those devices? Are early IoT device manufacturers liable for failing to properly market that those devices were, by the nature of their design, not going to work forever?",
      "author": "ThankGodImBipolar",
      "timestamp": "2025-05-06 04:22:53",
      "url": "https://reddit.com/r/LinusTechTips/comments/1kflw8a/at_what_point_is_it_okay_to_eol_an_iot_device/",
      "metadata": {
        "domain": "self.LinusTechTips",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "LinusTechTips",
      "score": 197,
      "num_comments": 88,
      "upvote_ratio": 0.93,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "19bixfz",
      "title": "Bbut boss, we can't renumber. We have too many Taiwanese IoT devices on VLAN1",
      "content": "",
      "author": "Garegin16",
      "timestamp": "2024-01-21 02:56:48",
      "url": "https://reddit.com/r/networkingmemes/comments/19bixfz/bbut_boss_we_cant_renumber_we_have_too_many/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "networkingmemes",
      "score": 771,
      "num_comments": 92,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1gzi7ht",
      "title": "How seriously really do I need to take the threat of insecure compromised IOT devices on my home network?",
      "content": "Been debating this with family. I was told that they had spoken to a friend of theirs in defence, and they very confidently said that there was little to no real risk to their personal devices — because all banking and financial transactions are encrypted and everything is 2FA. So it’s ok to have a compromised device on your home network. This is effectively complete bullshit, isn’t it.",
      "author": "iamhereunderprotest",
      "timestamp": "2024-11-25 20:57:24",
      "url": "https://reddit.com/r/HomeNetworking/comments/1gzi7ht/how_seriously_really_do_i_need_to_take_the_threat/",
      "metadata": {
        "domain": "self.HomeNetworking",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "HomeNetworking",
      "score": 125,
      "num_comments": 148,
      "upvote_ratio": 0.9,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n0gydr",
      "title": "Is it safe to download win 11 lstc iot from massgrave ?",
      "content": "I downloaded the first one cuz the one from Microsoft was evaluation version And why the heck is the ram usage high?? Its 35% without opening anything",
      "author": "Nightcresu",
      "timestamp": "2025-08-26 17:14:06",
      "url": "https://reddit.com/r/WindowsLTSC/comments/1n0gydr/is_it_safe_to_download_win_11_lstc_iot_from/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "WindowsLTSC",
      "score": 93,
      "num_comments": 57,
      "upvote_ratio": 0.86,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1k5zmrf",
      "title": "Do your run HA on Primary or IoT Network?",
      "content": "Do folks run Home Assistant on their primary or IoT network? And for those that have a PoE based Z2M such as SLZB-06, does that go on the primary or IoT network?",
      "author": "ajaffarali",
      "timestamp": "2025-04-23 21:48:53",
      "url": "https://reddit.com/r/homeassistant/comments/1k5zmrf/do_your_run_ha_on_primary_or_iot_network/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 71,
      "num_comments": 104,
      "upvote_ratio": 0.91,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "peht4b",
      "title": "BB Cybersecurity and iot Leader Undervalued by 10x",
      "content": "Just wanted to do a quick comparison analysis of Blackberry UES Ai Cybersecurity software with other in the same industry. Only other companies that can be compared with Blackberry Ai cybersecurity is Crowdstrike and SentenialOne, both use Ai for cybersecurity BUT they both have older Ai engine that comes nowhere close to BB Ai engine. CRWD market cap : $60 Billion ($800 mm annual rev) SentenialOne market cap: $17 Billion ( $100 mm annual rev) BB Blackberry market cap: $6 Billion ($1billion annual rev) &amp;#x200B; BB is not just leader in cybersecurity protecting 500 million endpoints including 200 million connected cars on the road but they are also providing the foundation for iot platform, QNX secure operating system. The QNX runs the entire medical device industry, drones, and controls over 78% of Ev connected car market. QNX is kinda monopoly with a HUGE moat because it has BB Ai engine embedded to prevent hacks and ransomeware and viruses. &amp;#x200B; I'm happy that WSB crowd and Apes are holding and brining much needed attention to this stock. This stock was being kicked around by analyst on purpose in hope that the company would go under 5 years ago so they can come buy patents and parts for cheap. &amp;#x200B; BB holds over 42,000 patents and over 70% of cybersecurity ai patents!!!! They are selling of their old business patents like messaging, phones, networking wireless to likely Facebook. Once it's announced the stock should do 3-4x. Not a financial advice but please look into BB. It's not a phone company but a leader in cybersecurity!!! they run iot and cybersecurity world for banks, defense, drones, cars, etc!!",
      "author": "ModernBuddha1",
      "timestamp": "2021-08-30 21:12:26",
      "url": "https://reddit.com/r/wallstreetbets/comments/peht4b/bb_cybersecurity_and_iot_leader_undervalued_by_10x/",
      "metadata": {
        "domain": "self.wallstreetbets",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "wallstreetbets",
      "score": 661,
      "num_comments": 196,
      "upvote_ratio": 0.9,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ncjep6",
      "title": "TIL a group of hackers managed to hack into a casinos' database of high rollers through the IoT enabled thermostat in the casinos' fish tank.",
      "content": "",
      "author": "unknownbeast009",
      "timestamp": "2025-09-09 21:47:53",
      "url": "https://reddit.com/r/Ubiquiti/comments/1ncjep6/til_a_group_of_hackers_managed_to_hack_into_a/",
      "metadata": {
        "domain": "thehackernews.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Ubiquiti",
      "score": 136,
      "num_comments": 44,
      "upvote_ratio": 0.94,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1l9vfyr",
      "title": "I hate that all my hobbies are basically just consumerism",
      "content": "For the past six years since I graduated college I feel like everything I have gotten into are basically just consumerism trap set up by capitalist marketers. I look around and all I see are just stuff. Everything I like are just stuff. Mechanical keyboards, techwear fashion, anime figures, movie artbooks, limited video games, desk setups, smart home iot devices, homelab equipment, custom plushies, backpack setups, edc toys, gachapon, perfumes, academic hardcovers, … probably more I feel like my hobbies are just straight up buying things. Maybe there’s also my cats, but I buy them useless stuff all the time too. I don’t know what to do. I have forgotten how to be happy without buying stuff. I’m not sure if I have a shopping addiction. My shopping cravings ebb and wane. Maybe it’s the adhd impulsive dopamine crave or the depression cathartic spending.",
      "author": "rexyuan",
      "timestamp": "2025-06-13 03:25:37",
      "url": "https://reddit.com/r/Anticonsumption/comments/1l9vfyr/i_hate_that_all_my_hobbies_are_basically_just/",
      "metadata": {
        "domain": "self.Anticonsumption",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Anticonsumption",
      "score": 2622,
      "num_comments": 379,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1kzibof",
      "title": "Windows 11 IoT LTSC 2022 setup",
      "content": "I bet you didn't know this existed lol.",
      "author": "Immediate_County_105",
      "timestamp": "2025-05-31 07:08:47",
      "url": "https://reddit.com/r/WindowsLTSC/comments/1kzibof/windows_11_iot_ltsc_2022_setup/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "WindowsLTSC",
      "score": 76,
      "num_comments": 77,
      "upvote_ratio": 0.84,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nwvnws",
      "title": "I built my first computer. Should I install Windows 11 IoT Enterprise LTSC?",
      "content": "Just heard about it. The question is: should I use it? Will it cause errors? Weighing my options.",
      "author": "Any-Bid-1116",
      "timestamp": "2025-10-03 18:44:00",
      "url": "https://reddit.com/r/WindowsLTSC/comments/1nwvnws/i_built_my_first_computer_should_i_install/",
      "metadata": {
        "domain": "self.WindowsLTSC",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "WindowsLTSC",
      "score": 25,
      "num_comments": 49,
      "upvote_ratio": 0.81,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "ju0td9",
      "title": "I designed this WhatsApp-connected, RFID-enabled, jack-o'lantern shaped PCB as a doorbell based on a Nano 33 IoT to get notified when my guests press it without checking the door every time and whether they are invited, handed an entrance permit (RFID tag) before entering the house, or not 🎃🎃🎃",
      "content": "Despite the fact that making a hilarious yet not deceitful joke with a jack-o'-lantern on Halloween night is not unobtrusive, I decided to create an exceptional event for my guests on Halloween when they ring the doorbell by designing a jack-o'-lantern doorbell with intriguing features. And, not surprisingly, I only let some of my closest friends know about my new doorbell features by giving them registered RFID tags (entrance permits) to make my other guests frightened even a little bit :) In detail, this doorbell talks to the guests and informs the user via WhatsApp when the guests ring the doorbell or show RFID tags or cards. [https://www.hackster.io/kutluhan-aktar/whatsapp-halloween-themed-rfid-talking-doorbell-w-rgb-eyes-de65e9](https://www.hackster.io/kutluhan-aktar/whatsapp-halloween-themed-rfid-talking-doorbell-w-rgb-eyes-de65e9) &amp;#x200B; https://preview.redd.it/2llok4i127z51.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=c9a450defc4e0c0b394755ee7da39ec262b5622b &amp;#x200B; https://preview.redd.it/18u89p1327z51.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=d63fe5be1d4559bd7744f271367c7eaaf629664d https://preview.redd.it/zd3drz1327z51.jpg?width=3000&amp;format=pjpg&amp;auto=webp&amp;s=7848fc30b4651d7b57204e84964037f095c08bb3",
      "author": "the-amplituhedron",
      "timestamp": "2020-11-14 19:51:18",
      "url": "https://reddit.com/r/DIY/comments/ju0td9/i_designed_this_whatsappconnected_rfidenabled/",
      "metadata": {
        "domain": "self.DIY",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "DIY",
      "score": 945,
      "num_comments": 128,
      "upvote_ratio": 0.8,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1g1funp",
      "title": "U7 pro iot issue explained",
      "content": "https://youtu.be/P7MBZ80HzmI?si=bb3r9qLqzgAKYbLY",
      "author": "Capt_shadab",
      "timestamp": "2024-10-12 01:55:51",
      "url": "https://reddit.com/r/Ubiquiti/comments/1g1funp/u7_pro_iot_issue_explained/",
      "metadata": {
        "domain": "youtu.be",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Ubiquiti",
      "score": 53,
      "num_comments": 161,
      "upvote_ratio": 0.68,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1fkb4gg",
      "title": "Massive China-state IoT botnet went undetected for four years—until now (list of infected devices included Synology NASes)",
      "content": "",
      "author": "uluqat",
      "timestamp": "2024-09-19 11:04:20",
      "url": "https://reddit.com/r/synology/comments/1fkb4gg/massive_chinastate_iot_botnet_went_undetected_for/",
      "metadata": {
        "domain": "arstechnica.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "synology",
      "score": 343,
      "num_comments": 73,
      "upvote_ratio": 0.96,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n3z1zg",
      "title": "It's now possible to uninstall Microsoft Edge in Windows 10/11 IoT Enterprise LTSC without having to set the region to the EU!",
      "content": "",
      "author": "TheBobPony",
      "timestamp": "2025-08-30 19:17:27",
      "url": "https://reddit.com/r/WindowsLTSC/comments/1n3z1zg/its_now_possible_to_uninstall_microsoft_edge_in/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "WindowsLTSC",
      "score": 132,
      "num_comments": 35,
      "upvote_ratio": 0.96,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "tujp0y",
      "title": "4 years ago Loopring replied to Elon suggesting Tesla do an ICO to buy back Tesla and use the coins for IOT payments in the Tesla Ecosystem. 💡Imagine the LRC x GME possibilities!",
      "content": "",
      "author": "BananyaBangarang",
      "timestamp": "2022-04-02 22:08:43",
      "url": "https://reddit.com/r/loopringorg/comments/tujp0y/4_years_ago_loopring_replied_to_elon_suggesting/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "loopringorg",
      "score": 1485,
      "num_comments": 59,
      "upvote_ratio": 0.95,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "q798lf",
      "title": "Tell me you don't use passwords for your IoT without telling me you don't use passwords for your IoT",
      "content": "",
      "author": "blubberty-quivers",
      "timestamp": "2021-10-13 19:36:44",
      "url": "https://reddit.com/r/homeautomation/comments/q798lf/tell_me_you_dont_use_passwords_for_your_iot/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeautomation",
      "score": 1221,
      "num_comments": 78,
      "upvote_ratio": 0.95,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nxowlt",
      "title": "Πάλι καλά βάλανε IOT solar powered smart παγκάκια στο ΔΙΠΑΕ",
      "content": "",
      "author": "Ok-Opportunity-8660",
      "timestamp": "2025-10-04 16:52:12",
      "url": "https://reddit.com/r/thessaloniki/comments/1nxowlt/πάλι_καλά_βάλανε_iot_solar_powered_smart_παγκάκια/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "thessaloniki",
      "score": 140,
      "num_comments": 25,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mcivtc",
      "title": "What is the correct way to block IoT devices from accessing the Internet?",
      "content": "I am looking for a simple method to block my IoT devices (light switches) from accessing the Internet and phoning home. Was thinking that pfBlocker NG might be a way to go but for some reason I am stuck coming up with the correct configuration. I have IoT devices on two different VLANS. Each IoT device is given a static IP.",
      "author": "RuralTechFarmer",
      "timestamp": "2025-07-30 02:10:14",
      "url": "https://reddit.com/r/PFSENSE/comments/1mcivtc/what_is_the_correct_way_to_block_iot_devices_from/",
      "metadata": {
        "domain": "self.PFSENSE",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "PFSENSE",
      "score": 20,
      "num_comments": 60,
      "upvote_ratio": 0.84,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n99ehg",
      "title": "Niet cse iot",
      "content": "Why so many seat are left in cse iot is it not good?? I mean what is the difference if I do cse core from niet and cse iot from niet.",
      "author": "Aditya__here",
      "timestamp": "2025-09-06 00:09:26",
      "url": "https://reddit.com/r/AKTU/comments/1n99ehg/niet_cse_iot/",
      "metadata": {
        "domain": "self.AKTU",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "AKTU",
      "score": 1,
      "num_comments": 53,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1adxkfs",
      "title": "If you were to start over with new IoT hardware for your home, what standard would you try to use as exclusively as possible - zwave, matter, wifi, zigbee etc. ?",
      "content": "I’m currently using a hodgepodge of devices, some connected to my Hue hub, some wifi, some proprietary. I’m close to deciding to start a complete tech refresh in order to simplify, standardize, and improve stability. Matter was still in its infancy a year ago but perhaps it’s now mature, reliable, and pervasive. Zigbee has devoted supporters but I’m unsure if this will slowly wane as Matter etc take over. Zwave seems to be getting a few posts in here lately so maybe I should be considering that. I certainly don’t want to be using wifi if I can help it for most of the many small simple devices around the house (switches, plugs, wall outlets, bulbs, etc). I’m totally enamoured with how Lutron caseta light switches just always work. Always. I’m unsure what they use but they set the standard for how I want everything else to work. I’d like to pick a standard and start moving things to that as I refresh my IoT tech over the next year. I suspect others have mulled this themselves and may have reached their own conclusions, or perhaps it’s timely to revisit this now for 2024. Opinions?",
      "author": "SpinCharm",
      "timestamp": "2024-01-29 23:12:13",
      "url": "https://reddit.com/r/homeassistant/comments/1adxkfs/if_you_were_to_start_over_with_new_iot_hardware/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 93,
      "num_comments": 201,
      "upvote_ratio": 0.92,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "wjztca",
      "title": "Thank you CrossTalk Solutions! Thanks to your video I now have a secure LAN that has access to IoT devices. And IoT/Guest networks that can’t access my secure LAN! So glad I finally took the time to do this!",
      "content": "",
      "author": "mchamp90",
      "timestamp": "2022-08-09 18:28:47",
      "url": "https://reddit.com/r/Ubiquiti/comments/wjztca/thank_you_crosstalk_solutions_thanks_to_your/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Ubiquiti",
      "score": 553,
      "num_comments": 126,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ldphfx",
      "title": "Should I go with windows 10 LTSC or Windows 11 IOT LTSC",
      "content": "I despise what windows 11 was made to be, it is everything an operating system shouldn't be. I was wondering if I should go with windows 10 LTSC or 11 LTSC (iot is that one I heard was best) I read that the ltsc version of 11 doesn't come with any of the garbage that's forced on the other versions like the spyware recall, insane bloatware and built in adds and resource hogs. I was going to use the windows 10 one but unfortunate some features of my motherboard will be unusable due to a lack of drivers that support win10 but I guess I won't be too sad about missing out on WIFI. My build would be a 9950X3D with 96 GB of ram, I will install the OS on an HDD as I find it to be more reliable and shouldn't realistically require an SSD for the tasks it does. would windows 11 end up eating like 20% of my ram for no reason at all, will I be able to avoid all the bloat, spyware and downgrades from 10 ? If I go with 10 will a push myself in a corner due to how the LTSC branch tends to be janky with upgrades ( at least that is what I was told. I was told for windows 11 the IOT LTSC was the better of the LTSC versions due to less bloat and better performance, is that true? Sorry if the question is rather dumb Sadly linux isn't an option for me as some of the games I play still do not support it for some dumb reason. does windows still hate dual booting on shared physical drives ?",
      "author": "TheLichKing-Zeyd",
      "timestamp": "2025-06-17 23:03:26",
      "url": "https://reddit.com/r/WindowsLTSC/comments/1ldphfx/should_i_go_with_windows_10_ltsc_or_windows_11/",
      "metadata": {
        "domain": "self.WindowsLTSC",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "WindowsLTSC",
      "score": 20,
      "num_comments": 69,
      "upvote_ratio": 0.82,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1jqn0rh",
      "title": "I did the trick to transform Windows 10 ioT LTSC 21H2 into ioT LTSC 22H2",
      "content": "I did the trick that the russian guy taught to transform the 21H2 ioT LTSC into 22H2 ioT LTSC. For now, it's working fine here for me. Immediately after I transformed it into 22H2, I've already received some updates for the 22h2 version. If you guys remember me, after the Home/Pro 22H2 EOL in October this year, I'll tell you if I'll be able to continue receiving updates in the LTSC channel.",
      "author": "ead123123123",
      "timestamp": "2025-04-04 00:29:52",
      "url": "https://reddit.com/r/WindowsLTSC/comments/1jqn0rh/i_did_the_trick_to_transform_windows_10_iot_ltsc/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "WindowsLTSC",
      "score": 94,
      "num_comments": 70,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nw2xan",
      "title": "ESPTimeCast – DIY IoT desk clock with live weather + web UI (ESP8266/ESP32 project)",
      "content": "I’ve been working on an open-source project called **ESPTimeCast** \\- a WiFi-connected LED matrix clock and weather station using ESP8266/ESP32 + MAX7219. • Syncs time with NTP • Fetches live weather from OpenWeatherMap • Full web interface for setup (WiFi, API key, brightness, units, etc.) — no reflashing needed • Config stored in flash (LittleFS), backup/restore supported • Cross-compatible with ESP8266 and ESP32 • 3D-printed case design included Repo: [https://github.com/mfactory-osaka/ESPTimeCast](https://github.com/mfactory-osaka/ESPTimeCast) I’d love to hear your feedback and suggestions",
      "author": "mfactory_osaka",
      "timestamp": "2025-10-02 20:52:14",
      "url": "https://reddit.com/r/IOT/comments/1nw2xan/esptimecast_diy_iot_desk_clock_with_live_weather/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 7,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nw27re",
      "title": "IOT with analog output",
      "content": "Is there any manufacturer of IOT senders that have a analog 4-20 input on the sensor side, and a analog output on the gateway or similar? I work at a place where we have a central buliding PLS with remote monitoring. And I plan on expand with a IO module in the workshop for remote monitoring of some equipment. But the equipment is mobile and is shared with other locations. Could i have a wireless solution on this? A sensor that communicates with a reciever, with a 4-20mA output that i could wire to the IO module.",
      "author": "Sure_Bookkeeper_4660",
      "timestamp": "2025-10-02 20:20:13",
      "url": "https://reddit.com/r/IOT/comments/1nw27re/iot_with_analog_output/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 1,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nvh11m",
      "title": "Who’s actually building the hardware behind IoT platforms?",
      "content": "I’ve been digging into IoT a lot lately, and one thing I keep noticing is how much attention goes to cloud platforms, apps, or protocols—but not as much to the factories and suppliers making the physical devices that everything runs on. I pulled together some research on manufacturers that offer private-label IoT hardware (sensors, hubs, modules) and already export globally. Some even specialize in low-volume runs, which surprised me because I always assumed custom IoT hardware was only for huge companies. Here’s the write-up I found useful: [https://www.xchainova.com/source/cmg818t53000lji04phle215h](https://www.xchainova.com/source/cmg818t53000lji04phle215h) Now I’m wondering: when it comes to evaluating an IoT startup or product, do you think the choice of manufacturer matters as much as the software stack? Or as long as the firmware and integration are solid, the supply chain side doesn’t really matter?",
      "author": "KeyRole7732",
      "timestamp": "2025-10-02 02:55:07",
      "url": "https://reddit.com/r/IOT/comments/1nvh11m/whos_actually_building_the_hardware_behind_iot/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 13,
      "num_comments": 11,
      "upvote_ratio": 0.84,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nv9jh1",
      "title": "Confused about how APIs work in real projects (IoT / Flutter / webdev)",
      "content": "Hi everyone, I’m an IoT major and I’ve built some small projects with Flutter for the frontend and Python for backend processing (like photo processing). So far, I’ve always just stored files locally (in a folder), then hard-coded the path, and let Flutter call the Python script directly. Repo (for reference): [https://github.com/Mahmoudbat/2d-cnc-printer](https://github.com/Mahmoudbat/2d-cnc-printer) But I realize this isn’t how things are done in the industry. From what I understand, people use **APIs** to communicate between frontend and backend. I tried to look into APIs but I got lost — there are so many (REST, GraphQL, WebSockets, MQTT, etc.). Here’s where I’m stuck: * Are APIs basically just a way to transfer messages, like TCP/UDP already do? * If so, why not just use TCP or UDP directly? * I see frameworks like FastAPI, Django, Flask — do they all just implement REST under the hood? * Is an “API” just a concept, while the framework decides how it’s actually implemented? For context: I’m joining a hackathon soon, and I need to process an image on my machine (Python) and represent it on a webpage (frontend). I’d love if someone could explain in beginner-friendly terms (with maybe a small example flow) how to structure this for a real-world project. Thanks in advance!",
      "author": "IMLE9",
      "timestamp": "2025-10-01 22:21:20",
      "url": "https://reddit.com/r/IOT/comments/1nv9jh1/confused_about_how_apis_work_in_real_projects_iot/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 4,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nufriz",
      "title": "Need some tips and ideas on getting started with IoT",
      "content": "I am in my last year of uni (cyber sec) and I am doing my dissertation on IoTs but something red teams/pentesty with it. I have experience in red team/offensive stuff but I’m quite new to IoT. So what should I know, like what resources are out there which are good to get started off with. Thanks for any ideas :)",
      "author": "ZombieReady9003",
      "timestamp": "2025-09-30 23:09:13",
      "url": "https://reddit.com/r/IOT/comments/1nufriz/need_some_tips_and_ideas_on_getting_started_with/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 1,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nrbifm",
      "title": "Doing a research study for product engineers/designers in the IoT field.",
      "content": "Hi Folks, I am doing a research study on product engineers/designers in the IoT field. Can you answer these questions I have if it applies to you? Thank you! It will be a big help for my research. 1. What are you currently building? 2. What tools are you currently using to build? 3. Do you get frustrated with your development process? If Yes / No, why? 4. Are you building a solution to solve a specific problem internally or for your company’s customers? 5. What’s a typical timeline (or range) does it take to build a prototype from concept? 6. How much % does these projects actually go to final design? 7. What are your top 3 pain points? 8. What websites or forums do you often visit / participate in relation to engineering / product development? 9. Who are people / influencers do you follow on social media?",
      "author": "jerusem",
      "timestamp": "2025-09-27 04:05:52",
      "url": "https://reddit.com/r/IOT/comments/1nrbifm/doing_a_research_study_for_product/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 8,
      "num_comments": 0,
      "upvote_ratio": 0.84,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nqh4nh",
      "title": "Do you “honour your mentors” in your industry—or is that just a chef thing?",
      "content": "I was watching MasterChef and noticed something unique about the food world. Chefs often train under other successful chefs, then when they branch out, they openly respect and honour that lineage. It’s part of their identity and even their brand: “I trained under X.” That got me thinking about other industries. In tech, IoT, mobile, and telecoms, we all know the big names—Jobs, Gates, Musk—but most of us never worked with them. The real mentors are often the quiet innovators, the first managers who pushed us, or even the people we only ever learned from online through posts, podcasts, or forums. So I’m curious: • In your field, is it common to openly celebrate the people you learned from? • Do you see professional “lineage” as a badge of credibility, or is it something kept private? • Who are the leaders, innovators, or even online voices in IoT/mobile/tech that you respect and still carry lessons from? Would love to hear how different industries handle this.",
      "author": "iotguys",
      "timestamp": "2025-09-26 04:07:15",
      "url": "https://reddit.com/r/IOT/comments/1nqh4nh/do_you_honour_your_mentors_in_your_industryor_is/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 0,
      "num_comments": 7,
      "upvote_ratio": 0.4,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nqcsh5",
      "title": "Trying to get some suggestion",
      "content": "I am thinking of making a iot based Energy meter for my minor project 1, I will make the voltage sensor by myself on a pcb , i am thinking of using the curcuit attached to reduced the voltage to 0-3.3V and then do some calculations in the esp code to get the original value back , I want to know if there are any improvements i can do , the values of capacitors and resistors are temporary , i will do the proper calculations later , I am going to use the current sensor directly not making it myself , using thingspeak , oled display etc are also on my list. Thank you in advance..",
      "author": "s-o_ul",
      "timestamp": "2025-09-26 01:21:04",
      "url": "https://reddit.com/r/IOT/comments/1nqcsh5/trying_to_get_some_suggestion/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 9,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1npjbtn",
      "title": "IOT prototype + NFT?",
      "content": "We are all inventors at heart but the it’s tough raising funds. What if we as creators used NFTs to sell exclusive perks to help fund our inventions? Say you make an NFT and sell it for $100. Then you tell people if they buy it, they get a 1 on 1 call with you and get a prototype? Something simple. What are your thoughts?",
      "author": "Liberty_Forever",
      "timestamp": "2025-09-25 02:04:17",
      "url": "https://reddit.com/r/IOT/comments/1npjbtn/iot_prototype_nft/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 0,
      "num_comments": 15,
      "upvote_ratio": 0.27,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1npj894",
      "title": "Need business perspective/case study(ies) on implementation of Industrial IOT for digitization in Process/manufacturing industries.",
      "content": "Hello to all folks of this sub! I may have the opportunity to work at a company building Industrial IOT platforms for a sales/BD role. I am looking for published (preferably open source) case studies that illustrate digitization via Industrial IOT in process/manufacturing industry. A bird's eye view of the same is what I will require to begin with. This, followed by choice of data standards/data models will be very helpful to me. Tool/Industry agnostic at this moment, so anything goes. Also., I am VERY HAPPY to read your experience in these two areas, even if you want to mask the details of tool used /firm where implemented. Thanks,",
      "author": "Paul-Scholes",
      "timestamp": "2025-09-25 02:00:40",
      "url": "https://reddit.com/r/IOT/comments/1npj894/need_business_perspectivecase_studyies_on/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 0,
      "num_comments": 3,
      "upvote_ratio": 0.5,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1noc7bj",
      "title": "The IoT Wall of Fame - The Things Conference",
      "content": "The things conference wall of frame. A few years ago it was all PCBs and now mostly products.",
      "author": "Background_Heron_685",
      "timestamp": "2025-09-23 16:51:29",
      "url": "https://reddit.com/r/IOT/comments/1noc7bj/the_iot_wall_of_fame_the_things_conference/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 64,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nnyti5",
      "title": "Watmonitor - liquid level / bulk material height monitoring web interface",
      "content": "Watmonitor is a webapp which I developed from time-to-time during last 2 years to nowadays look. Started as a university project. It works as a gateway, that allows you to receive and store data from a IoT sensor node that can be DIY hardware (ESP32, Arduino) based, or industrial-grade based. It has real-time overview page and then other pages, where you can see historical and statistics datas, such as: Maximum / minimum level measured per month, week, day. There is historical table that consist of all the data ever recorded, as admin you can delete exact measurement that you like. In graphs you can see the whole water level measured during different time periods. These line graphs can be download in .csv, .svg or .png format for further analysis or visualisation in 3rd party softwares. Watmonitor can be integrated to 3rd party systems directly using two JSON endpoints that are providing the latest data, or for a specific time period (from-to, or all from, or all to, or totally all). Working and tested with Node-RED, but also with Home Assistant. By integration you can get more notification features, or automatization for irrigation, home pump control etc. Watmonitor is translated to English, German, Russian, Slovak, Spanish, French language. There is available a online web interface of instance of Watmonitor, that you can test and use for free with your hardware based on Arduino, ESP32, ESP8266 (can't guarantee you will be only one writing the data, as is public interface). There are a lot of prototyping software and source codes available, including standard, but also low power or OTA modes. Possible to use ultrasonic distance sensors (JSN-SR04T, HC-SR04), or ToF laser sensors such as VL53L1X (TOF400C). Software available is for Arduino Core, but also for ESP-IDF framework with FreeRTOS and inter-task communication using Queues. Usable for absolute begineers, or more advanced users. There are some experiemntal implementations for LoRa (PPP), LoRaWAN, NB-IoT, Sigfox LPWAN connectivity aswell. But as web interface is universal, can be used with any other sensor technology, or industrial bus, where you can configure and set the requeired HTTPS POST request pattern. Watmonitor is extended by QR scanner feature, that allows you to get the latest sensor data by scanning the QR code on device (usable for big installations with many sensor nodes), or there can be used also tailor-made AR (Augmented Reality) orbital visualisation with dashboard.",
      "author": "deadawp",
      "timestamp": "2025-09-23 05:14:29",
      "url": "https://reddit.com/r/IOT/comments/1nnyti5/watmonitor_liquid_level_bulk_material_height/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nns7b4",
      "title": "LTE in IOT devices starting help",
      "content": "Hello, I am working on a project where I need to have cellular connectivity to send the data from sensors back to a server. I am pretty new to integrating cellular into projects. When I look online the sources don't really seem to be helpful. Maybe I'm just looking up the wrong things. I was wondering if anyone had some resources they recommend on getting started for picking out the required hardware on the cellular side. We are looking to possibly get hardware that can work on all major US providers. Any resources to get me going down the right path on learning a bit more would be much appreciated.",
      "author": "TrailHazer",
      "timestamp": "2025-09-23 01:04:59",
      "url": "https://reddit.com/r/IOT/comments/1nns7b4/lte_in_iot_devices_starting_help/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 1,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nnll9c",
      "title": "Improve IoT device integration workflow",
      "content": "Hey everyone, I’m a software engineer at an IoT solutions company. I recently developed a tool to help me integrate new IoT devices more efficiently. When my boss asks me to integrate a new IoT device, I need to study the device’s documentation to extract the relevant commands (mainly Modbus in my case, but I also work with other protocols). To streamline this process, I built a tool that uses AI to analyze the documentation for me. Initially, the responses weren’t accurate, so I spent some time experimenting with RAG and prompt engineering. After analyzing and extracting the Modbus commands, the tool automatically sends the commands to the device for verification. Once the process is complete, it generates a library with device-specific functions that I can call, saving me the time of studying the documentation manually. I’m now thinking about how AI can help me with other parts of my job. How do you guys use AI to improve your workflow as engineers? I’d love to hear your experiences!",
      "author": "KeyConsideration8216",
      "timestamp": "2025-09-22 20:50:37",
      "url": "https://reddit.com/r/IOT/comments/1nnll9c/improve_iot_device_integration_workflow/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nmgvo0",
      "title": "Beginner",
      "content": "So recently I started taking a course on iot hacking since my degree is in cybersecurity but I lack some theory and understanding of iot Currently i bought an arduino kit and building projects but would like to know electricity and IoT topics to make me more capable. I know a little c and rust. So im trying to find a solid pathway to be more proficient in the subject. Thank you",
      "author": "Ok-Willingness-9942",
      "timestamp": "2025-09-21 10:52:15",
      "url": "https://reddit.com/r/IOT/comments/1nmgvo0/beginner/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 2,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nmel4n",
      "title": "ESP8266 + SIM900 GPS Tracker with Flask + Leaflet Map UI",
      "content": "Hey folks, I’ve been working on a little IoT project that combines two **ESP8266 boards, a GPS module, and a SIM900 GSM modem** to track vehicle location and display it on a live map. Thought I’d share the build since it came together nicely! # 🔧 What it does * **Sender Node (ESP8266 + NEO-6M GPS):** reads latitude/longitude + timestamp and broadcasts it over a mesh network. * **Receiver Node (ESP8266 + SIM900):** receives that data, then forwards it to a Flask server via GPRS (HTTP POST). * **Flask Server:** stores incoming coordinates and serves them as JSON. * **Leaflet Map (index.html):** pulls the stored route and plots it with markers + time filters. # 📂 Repo Full code + schematics are on GitHub here: 👉 [GitHub Repo – esp8266-gps-tracker](https://github.com/alec-kr/esp8266-gps-tracker/tree/main) I’d love feedback on: * Improving the mesh receiver logic. * Best practices for handling SIM900 power brownouts. * Other ideas for expanding this (MQTT broker, logging to a database, etc). Thanks for checking it out! # 🖼 Screenshot of the front-end * Map UI showing GPS points + timestamps * Time filtering between 12:00–14:00 highlights only the journey segment https://preview.redd.it/mrpkzmy82fqf1.png?width=1025&amp;format=png&amp;auto=webp&amp;s=b2d50c18110e4b9d9cc3caa00cebc8f674b66dbb",
      "author": "storman121",
      "timestamp": "2025-09-21 08:54:51",
      "url": "https://reddit.com/r/IOT/comments/1nmel4n/esp8266_sim900_gps_tracker_with_flask_leaflet_map/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 8,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nl4yv2",
      "title": "Recommendations for IoT sim card in the UK?",
      "content": "I'm looking for a UK based IoT SIM, there are so many in the market. Any recommendations please? This is for circa 1.5 GB a month usage cat 1 or cat 4 LTE.",
      "author": "bro_dunno_anything",
      "timestamp": "2025-09-19 22:23:51",
      "url": "https://reddit.com/r/IOT/comments/1nl4yv2/recommendations_for_iot_sim_card_in_the_uk/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 2,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1njgp1l",
      "title": "What do i need to do to become a capable IoT engineer?",
      "content": "Basically what the title says. im doing BTech in Electronics and communications engineering with specialization in AI&amp;ML (second year). I find an interest in IoT and i want to peruse it. What are the demands of it in today's time? What courses are a compulsion for me to do? how much CGPA do i need? I would really appriciate a detailed answer. Thanks in advance.",
      "author": "Pasta_Burger",
      "timestamp": "2025-09-17 23:44:22",
      "url": "https://reddit.com/r/IOT/comments/1njgp1l/what_do_i_need_to_do_to_become_a_capable_iot/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 10,
      "num_comments": 7,
      "upvote_ratio": 0.92,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nit3w8",
      "title": "Attending Tech IoT Expo ?",
      "content": "Is anyone from this community attending the IoT Tech Expo in Amsterdam? I run a product engineering service company (hardware, software, IoT, AI), and we are showcasing at Tech IoT Expo. Would love to meet fellow founders, engineers, or tech enthusiasts there. Let’s connect and exchange notes!",
      "author": "RNDSquare",
      "timestamp": "2025-09-17 04:39:34",
      "url": "https://reddit.com/r/IOT/comments/1nit3w8/attending_tech_iot_expo/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 11,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nhmojn",
      "title": "Edgeberry, the Raspberry Pi based IoT platform is featured in the Raspberry Pi Magazine of this month!",
      "content": "",
      "author": "SpuQyballz",
      "timestamp": "2025-09-15 22:01:28",
      "url": "https://reddit.com/r/IOT/comments/1nhmojn/edgeberry_the_raspberry_pi_based_iot_platform_is/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 6,
      "num_comments": 0,
      "upvote_ratio": 0.88,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nhf1as",
      "title": "Sharing How We Integrated ESP32 &amp; Touch Display for Oxygen Concentrator Control",
      "content": "We recently wrapped up an **Oxygen Concentrator Control System** project and thought it might be interesting to share here for anyone working with ESP32 or medical/IoT devices. * **Hardware**: 3.5” touch screen, RTC, WiFi, relay, current sensor * **Firmware**: ESP32 web server, web socket, RTC integration, scheduling + OTA updates * **UI**: Built with Squareline Studio for a clean touch interface It took about 3 months total — first version delivered in \\~2 months, then after testing, we iterated quickly and released V2.0 with more firmware features in just 3 weeks. One thing we found especially useful was combining **ESP32 webserver + touch UI** for local + remote control. It gave the end-user flexibility without needing cloud-only access. Here’s the case write-up if you want to dive deeper into the details: [https://www.makerfabs.com/case/post/oxygen-concentrator-control-system](https://www.makerfabs.com/case/post/oxygen-concentrator-control-system) Curious if anyone here has done similar **ESP32 + touch display** projects for IoT or even healthcare devices — what challenges did you face?",
      "author": "Vearts",
      "timestamp": "2025-09-15 15:06:22",
      "url": "https://reddit.com/r/IOT/comments/1nhf1as/sharing_how_we_integrated_esp32_touch_display_for/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 11,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nf5ijm",
      "title": "Need guidance for my project",
      "content": "We were given the task to create an iot project. We decided to do a smart child trap in car detector that is powered by solar panel. We are total newbies in this and totally dont know what we are doing. We have given prompts to chatgpt and told to buy these things ESP32 NodeMCU SIMCom A7670E 4G Module SCD40 CO₂ Sensor Module Load Cell + HX711 Module (weight) TP4056 Charging Module XL4015 Step-Down Converter (5A) 18650 Li-Ion Battery (Flat Top Battery Holder for 18650 Electrolytic Capacitor (e.g., 25 V 1000 µF) Ceramic Capacitor (0.1 µF) AWG 22–24 Stranded Wire USB Cable (Micro-USB) M-m m-f jumpers Breadboard (830) Solar panel (picture attached) We also do not have soldering tools and a multimeter. Is it important for this project? Is that all that we needed to buy? Does anyone know step by step tutorial on how to do this? Please tell us everything we need to know/take into consideration and so so sorry if its too ambitious of us to do these though we have no IT backgrounds 🙏 we are foundation students so its our first time getting to do projects like this",
      "author": "curi0usboutchu_",
      "timestamp": "2025-09-12 22:59:31",
      "url": "https://reddit.com/r/IOT/comments/1nf5ijm/need_guidance_for_my_project/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 7,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nexn20",
      "title": "Edgeberry Device Hub - Self-hostable IoT Device Management Service",
      "content": "",
      "author": "SpuQyballz",
      "timestamp": "2025-09-12 16:25:27",
      "url": "https://reddit.com/r/IOT/comments/1nexn20/edgeberry_device_hub_selfhostable_iot_device/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 6,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nemf71",
      "title": "How to Take Photos with Raspberry Pi Pico 2W and Arducam (Part 1) - Photo Capture On-Device Storage",
      "content": "Hello Reddit, This guide I made shows how to take a photo with an Arducam Mini Module (OV2640, 2MP) on a Raspberry Pi Pico 2 W using CircuitPython, and save the JPEG directly to the board’s filesystem (/images). It’s a minimal, reliable starting point for camera projects, data collection, or low-power IoT devices that snap and stash pictures locally. This is a cool way to make some awesome IoT projects with Python! You can take it a step further you like and send images to the cloud, or do some other analysis on the device itself. [https://www.youtube.com/watch?v=kZL5N1eeigQ](https://www.youtube.com/watch?v=kZL5N1eeigQ) If you like Python or Microelectronics content, please consider subscribing to the channel! Thanks, Reddit",
      "author": "QuietRing5299",
      "timestamp": "2025-09-12 06:22:02",
      "url": "https://reddit.com/r/IOT/comments/1nemf71/how_to_take_photos_with_raspberry_pi_pico_2w_and/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nelt06",
      "title": "GoAhead Museum – Research Dataset",
      "content": "This repository is a catalog of embedded GoAhead / jhttpd web server binaries collected from router and IoT firmware. The aim is to preserve these binaries as a historical research dataset, supporting the study of goform-based web servers, their variants, and their security issues. 📜 Note: Only a cursory exploration of these binaries were performed leaving them fertile fields to find vulnerabilites.",
      "author": "InsectRemedy",
      "timestamp": "2025-09-12 05:55:33",
      "url": "https://reddit.com/r/IOT/comments/1nelt06/goahead_museum_research_dataset/",
      "metadata": {
        "domain": "github.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 2,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1neamqt",
      "title": "What are the real career opportunities in IoT in Europe?",
      "content": "I’ve been exploring IoT as a potential career path and I’m trying to get a clearer picture of the opportunities in Europe. I know “IoT” as a keyword is sometimes vague and doesn’t always show up directly in job titles, so I’d like to ask this community for some advice. Specifically, I’m curious about: * **Career paths:** What are the main directions people usually take? For example: * **IIoT (Industrial IoT)** * **IoT embedded development (hardware + firmware)** * **Cloud/DevOps-focused IoT (infrastructure, pipelines, data, edge-cloud integration)** * **Field IoT / deployment &amp; integration** * **Job titles:** Since “IoT Engineer” or “IoT Specialist” isn’t always the keyword, what titles should I actually search for? (System Integrator? Embedded Systems Engineer? Cloud Engineer? Solution Architect?) * **Applications:** What are the hottest or most promising fields for IoT in Europe? (Factories &amp; manufacturing, smart cities, agriculture, environmental monitoring, energy, space, healthcare, etc.) * **Salaries &amp; competitiveness:** How do IoT-related jobs compare to other IT fields (software dev, cloud, cybersecurity, data science) in terms of pay and career growth? * **Entry barrier:** Is IoT seen as a niche requiring very specific expertise, or can someone with a general IT/software background transition into it relatively smoothly? * **Regional hotspots:** Are there particular countries or cities in Europe where IoT is more active (Germany with IIoT? The Netherlands with smart cities? Northern Europe with sustainability? etc.) Basically, I’d love to hear from people already working in the field about what the market really looks like, what kind of backgrounds are valued, and whether it’s a good bet career-wise compared to other IT directions. Any insights, resources, or personal experiences would be super helpful!",
      "author": "ProduceInevitable957",
      "timestamp": "2025-09-11 22:40:44",
      "url": "https://reddit.com/r/IOT/comments/1neamqt/what_are_the_real_career_opportunities_in_iot_in/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 11,
      "num_comments": 4,
      "upvote_ratio": 0.87,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1neal4h",
      "title": "Cloud vs networking: what’s worth focusing on?",
      "content": "Hi everyone, I’ve been thinking about the future of IT and technical skills. Over the past few years, cloud has been at the center of everything, but I’m wondering if in the mid-term it might lose some of its appeal, or if it will remain the main skill to focus on. In your opinion, what makes more sense to invest in: * building strong networking fundamentals (routing, switching, TCP/IP) * pursuing certifications like Cisco CCNA * or diving into IoT-related protocols and technologies such as MQTT, LoRaWAN, and telecom in general? I’d love to hear from people already working in the field or who have recently made these choices. What’s the best approach to avoid putting all my bets only on cloud? Thanks in advance for your insights!",
      "author": "ProduceInevitable957",
      "timestamp": "2025-09-11 22:38:53",
      "url": "https://reddit.com/r/IOT/comments/1neal4h/cloud_vs_networking_whats_worth_focusing_on/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 0.75,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ne6q9o",
      "title": "What’s your prediction for IoT in self-driving cars in the next three years innovation or empty hype?",
      "content": "IoT in self-driving cars is fueling real innovation right now. Cars are becoming smarter with better sensors, faster data sharing, and networked safety features that evolve every day. Over the next three years, expect big strides in smart road navigation, predictive maintenance, and cloud-powered updates, not empty hype, but tech drivers will actually notice. What do you predict: true revolution or just more buzz?",
      "author": "Wash-Fair",
      "timestamp": "2025-09-11 19:51:56",
      "url": "https://reddit.com/r/IOT/comments/1ne6q9o/whats_your_prediction_for_iot_in_selfdriving_cars/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 4,
      "num_comments": 6,
      "upvote_ratio": 0.75,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nddr4n",
      "title": "What is your personal coolest iot you made?",
      "content": "Hello I'm just curious to see what is your coolest iot thing that you made?",
      "author": "Mr-frost",
      "timestamp": "2025-09-10 21:08:33",
      "url": "https://reddit.com/r/IOT/comments/1nddr4n/what_is_your_personal_coolest_iot_you_made/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 3,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nd4kbb",
      "title": "Making voice AI actually conversational requires rethinking the entire flow",
      "content": "Built voice control for our smart home devices that actually understands context and doesn't need wake words for everything. THE PROBLEM: Traditional IoT voice control is basically shouting commands at devices. \"Alexa, turn on living room lights.\" \"OK Google, set temperature to 72.\" It's functional but nobody wants to talk to their house like that constantly. WHAT ACTUALLY WORKS: Made the devices understand conversational context. Walk into a room and say \"too bright\" and it dims. Say \"actually a bit more\" and it adjusts. No wake words, no specific command syntax, just natural speech. The key was moving processing to the edge. Each device runs a lightweight model that understands context from the room it's in. Kitchen device knows \"start the timer\" means oven timer. Bedroom device knows \"too cold\" means adjust thermostat. IMPLEMENTATION: - Local wake word detection on ESP32 - Streaming audio to edge server on premises - Small LLM (3B params) running on local GPU - Device control via MQTT - Using agora for audio transport when controlling remotely The remote control part was interesting. When you're away from home, the app streams your voice commands through WebRTC to your local network, processes them on your edge server, then controls devices. Keeps everything private, no cloud dependency. Latency is around 200ms for local commands, 400ms for remote. Power consumption increased by about 15% per device but worth it for the natural interaction. Biggest surprise was how much context matters. The same command means different things in different rooms at different times. \"Turn it off\" at night in bedroom means lights. Same command in kitchen during cooking means timer. Anyone else working on conversational IoT? What's your approach to context awareness?",
      "author": "anikeithkumar",
      "timestamp": "2025-09-10 12:16:12",
      "url": "https://reddit.com/r/IOT/comments/1nd4kbb/making_voice_ai_actually_conversational_requires/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 10,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ncb0jw",
      "title": "Voice control for IoT: expectations vs reality",
      "content": "EXPECTATION: \"Hey device, do the thing\" *device does thing* REALITY: - Process wake word locally (100ms) - Stream audio to cloud (50-200ms) - Speech recognition (100ms) - Intent processing (50ms) - Response generation (100ms) - Command execution (50ms) - User wondering why it's so slow Testing various platforms (Agora IoT, AWS IoT, custom). The problem isn't any single component - it's the cumulative latency. Anyone cracked sub-500ms voice response on IoT devices?",
      "author": "unnamednewbie",
      "timestamp": "2025-09-09 13:54:25",
      "url": "https://reddit.com/r/IOT/comments/1ncb0jw/voice_control_for_iot_expectations_vs_reality/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 6,
      "num_comments": 2,
      "upvote_ratio": 0.81,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nbfqy8",
      "title": "Are there any good books for iot",
      "content": "I understand the hardware part of the iot process to an extent on my own are there any good books to understand the coding part for complex projects as I want to test federated learning on the devices",
      "author": "Mother-Citron1029",
      "timestamp": "2025-09-08 13:52:53",
      "url": "https://reddit.com/r/IOT/comments/1nbfqy8/are_there_any_good_books_for_iot/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n843vd",
      "title": "Need help with finding mini square displays for a project",
      "content": "For context: I've gone into programming and IoT for atleast a good 8 months now and I have built some good DIY small projects recently that has been successful, so I thought, why not going up in difficulty with a bang and a big project of mine, making a VR headset from the ground up. Now i've been hunting things I needed just for this, y'know gyroscope, accelerometer, the main board and all of that, but i'm missing 1 thing, the display I kid you not, i have looked everywhere and i can't find any square displays. So i need y'alls help, where could i get a good mini square screen that could be used in a vr headset? Appreciate y'all!",
      "author": "GoldL246",
      "timestamp": "2025-09-04 15:58:56",
      "url": "https://reddit.com/r/IOT/comments/1n843vd/need_help_with_finding_mini_square_displays_for_a/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 1,
      "num_comments": 2,
      "upvote_ratio": 0.67,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n7jjrp",
      "title": "Compact Predictive Maintenance Edge AI Model",
      "content": "Hi everyone, I’ve been working solo on an edge AI model for predictive maintenance. It’s a deep learning model trained on NASA datasets and compatible with fine-tuning for custom industrial data. Optimized for IoT edge devices (size ~10–20 MB), so it runs in real time without needing the cloud. Designed to detect equipment failures early and reduce unplanned downtime. I’d love to get community thoughts on: Is this kind of compact edge AI valuable to OEMs and industrial players (Siemens, Caterpillar, ABB, etc.)? Does the pricing/licensing model sound realistic? Any pitfalls or considerations I might be missing? I’m not here to sell—just validating if this project is worth pursuing further. Appreciate any honest feedback!",
      "author": "Dear_Raise_2073",
      "timestamp": "2025-09-04 00:28:34",
      "url": "https://reddit.com/r/IOT/comments/1n7jjrp/compact_predictive_maintenance_edge_ai_model/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n7cwtw",
      "title": "Low-cost Modbus to IoT gateway setup?",
      "content": "Connecting Modbus sensors to the Cloude could be done with ESP32 equipped with Ethernet/Wi-Fi, the challenge is reliable communication and handling multiple devices on the bus. There's a guide that explains using ESP32 Ethernet controllers for Modbus TCP, including Network configuration and explains using ESP32 Ethernet controllers for Modbus TCP, including network configuration and expansion options: Industrial ESP32 Ethernet Controller (ENET) Following such docs helps bridge field devices into IoT platforms without redesigning hardware from scratch.",
      "author": "KavindaMahesh",
      "timestamp": "2025-09-03 20:03:14",
      "url": "https://reddit.com/r/IOT/comments/1n7cwtw/lowcost_modbus_to_iot_gateway_setup/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 2,
      "num_comments": 0,
      "upvote_ratio": 0.75,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n2v1h6",
      "title": "\"No-Cloud Needed\" License for IoT Devices",
      "content": "Hi r/IOT, I’ve drafted a “No-Cloud Needed” License aimed at helping users easily identify IoT devices that work fully offline, without forced cloud connections, subscriptions, or vendor lock-in. The goal is to encourage manufacturers to build products that respect user privacy, offer local control, and keep essential features available even if the cloud goes away. I’d love feedback from the IoT community: Are there any existing indicators or websites you use to ensure a device can be used without vendor lock-in? You can read the draft license and details here: [https://j89.net/nocloudneeded/](https://j89.net/nocloudneeded/) Any thoughts or suggestions would be greatly appreciated!",
      "author": "SometimesInBrooklyn",
      "timestamp": "2025-08-29 10:02:48",
      "url": "https://reddit.com/r/IOT/comments/1n2v1h6/nocloud_needed_license_for_iot_devices/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 9,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n2ov25",
      "title": "[DEMO] Smart Buildings powered by SparkplugB, Aklivity Zilla, and Kafka",
      "content": "This [**DEMO**](https://github.com/aklivity/zilla-demos/tree/main/smart-buildings) showcases a Smart Building Industrial IoT (IIoT) architecture powered by SparkplugB MQTT, Zilla, and Apache Kafka to deliver real-time data streaming and visualization. Sensor-equipped devices in multiple buildings transmit data to SparkplugB Edge of Network (EoN) nodes, which forward it via MQTT to Zilla. Zilla bridges these MQTT streams to Kafka, enabling downstream integration with Node-RED, InfluxDB, and Grafana for processing, storage, and visualization. https://preview.redd.it/xqd0dyvrttlf1.png?width=1600&amp;format=png&amp;auto=webp&amp;s=22193886003e966a8865ba2ef13a2a34f3a18a5b There's also a [**BLOG**](https://www.aklivity.io/post/fourth-industrial-revolution-industry-4-0-enabling-iiot-with-real-time-data-products) that adds additional color to the use case.",
      "author": "jkriket",
      "timestamp": "2025-08-29 05:28:48",
      "url": "https://reddit.com/r/IOT/comments/1n2ov25/demo_smart_buildings_powered_by_sparkplugb/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "is_self": true
    }
  ],
  "collection_time": "2025-10-06T11:54:30.258924",
  "keyword": "iot",
  "exact_match": true
}