{
  "status": "success",
  "data_source": "time_all",
  "total_posts": 100,
  "posts": [
    {
      "platform": "reddit",
      "post_id": "1lq7mm3",
      "title": "What is MQTT?",
      "content": "Hello, I plan to build a [AI-in-the-edge](https://github.com/jomjol/AI-on-the-edge-device) device for mesuring my water and it says it's MQTT compatible. I am using Zigbee2MQTT in my Home Assistant but I'm not sure if it would work because it's Zigbee and I don't really understand what is MQTT. Can my device works via my Zigbee network?",
      "author": "Keensworth",
      "timestamp": "2025-07-03 05:17:06",
      "url": "https://reddit.com/r/homeassistant/comments/1lq7mm3/what_is_mqtt/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 0,
      "num_comments": 6,
      "upvote_ratio": 0.17,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1naw1jl",
      "title": "Some questions about MQTT",
      "content": "Hi, can you help me with these questions? 1. I have map reporting enabled and have set the precision to 50m through the web UI. However, on [meshmap.net](http://meshmap.net) my node is showing with a precision of 1,457 m and on [https://meshtastic.liamcottle.net/](https://meshtastic.liamcottle.net/) I am in the exact same position with a precision of 2km. I have set a fixed position and it looks correct on the phone app map, but on the web maps it is way off. How can I improve the precision and get my node to the right position in the maps? 2. I have my own MQTT Server (Mosquitto) that I use with Home Assistant. If I wanted to send MQTT command over Meshtastic I could presumably set the MQTT Server to mine, but presumably that would mean that the Map Reporting would stop working? 3. If I wanted to help bridge networks I could set Uplink and Downlink to enabled on channels. However the zero hop policy on the Public PSK channel presumably means that it would not be of much use to others. In effect I would have to arrange for two areas to in a shared private channel to effectively communicate with each other? Thanks!",
      "author": "Stellarat",
      "timestamp": "2025-09-07 23:24:22",
      "url": "https://reddit.com/r/meshtastic/comments/1naw1jl/some_questions_about_mqtt/",
      "metadata": {
        "domain": "self.meshtastic",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 1,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mftkfw",
      "title": "MQTT usecases",
      "content": "Hey guys, a newbie here Can soneone please explain to me, why you would want to connect your Meshtastic devices to the Internet? Does that not defeat the purpose of having off-grid communications and involve privacy risks? I just got started with two Heltek V3 ESP32 boards yesterday and exploring ways to expand my range, as we live in a fairly hilly area and I don't see any other nodes around me. Looking forward to going heads first down this meshtastic rabbit hole :D",
      "author": "Tippexmann",
      "timestamp": "2025-08-02 23:38:17",
      "url": "https://reddit.com/r/meshtastic/comments/1mftkfw/mqtt_usecases/",
      "metadata": {
        "domain": "self.meshtastic",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 8,
      "num_comments": 27,
      "upvote_ratio": 0.83,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1m1ol8q",
      "title": "What is the consensus on MQTT for nodes?",
      "content": "I am totally new to Meshtastic. I received my first node today, the SenseCAP T1000-E, and I love its portability so far. Throughout setting it up, I have been unsure if should enable MQTT? In my area, I have not been able to find other nodes via LoRa, but looking on sites such as MeshMap, I can see that there are some MQTT enabled nodes in my area. If any of you have suggestions or advice about MQTT, it would be greatly appreciated 😊 thanks!",
      "author": "AlertKangaroo6086",
      "timestamp": "2025-07-17 05:06:53",
      "url": "https://reddit.com/r/meshtastic/comments/1m1ol8q/what_is_the_consensus_on_mqtt_for_nodes/",
      "metadata": {
        "domain": "self.meshtastic",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 4,
      "num_comments": 31,
      "upvote_ratio": 0.75,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ni47yo",
      "title": "MQTT and Routers",
      "content": "I have a question for those that know. My understanding is that when you turn mqtt on for a client node, the Meshtastic mqtt server enforces a \"zero hop\" rule which prevents that client from sending/forwarding the mqtt packets received from the meshtastic mqtt servers out onto the local Mesh. I believe the mqtt traffic is only visable to the person connected to the client that has mqtt enabled. What happens when a router is enabled to connect to mqtt? Is it still subject to the same Zero hop rule? If my understanding of how mqtt is handled, please explain what I am not understanding.",
      "author": "FJRpilot",
      "timestamp": "2025-09-16 09:25:27",
      "url": "https://reddit.com/r/meshtastic/comments/1ni47yo/mqtt_and_routers/",
      "metadata": {
        "domain": "self.meshtastic",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 2,
      "num_comments": 6,
      "upvote_ratio": 0.75,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1npankz",
      "title": "Typed MQTT client in Rust: compile-time topic validation &amp; auto-routing",
      "content": "**TL;DR:** A wrapper over `rumqttc` that gives you *compile-time safe MQTT topics, auto-deserialization, and IDE autocomplete* for parameters &amp; payloads. No more typos, no more manual parsing. Debugging MQTT topic typos sucks. You publish to `sensors/kitchen/temperature` and a week later subscribe to `sensor/kitchen/temp` — nothing works, and you waste time chasing invisible mistakes. Dynamic topics make it even worse, plus you need to manually parse and deserialize payloads everywhere. I built a wrapper over `rumqttc` that makes this type-safe at compile time. #[mqtt_topic(\"sensors/{location}/{device_id}/data\")] struct SensorTopic { location: String, device_id: u32, // extracted from topic! payload: SensorData, // auto-deserialized } // Publishing client.sensor_topic().publish(\"kitchen\", 42, &amp;data).await?; // IDE knows you need (String, u32, SensorData), autocomplete works // Subscribing let mut subscriber = client.sensor_topic().subscribe().await?; // ^ automatically subscribes to \"sensors/+/+/data\" if let Some(Ok(msg)) = subscriber.receive().await { println!(\"{} in {} sent {:?}\", msg.device_id, msg.location, msg.payload); } **Highlights:** * Compile-time validation of topics * Strongly typed parameters &amp; payloads * Auto-deserialization (JSON, bincode, msgpack, etc.) * IDE autocomplete for topic params &amp; payload fields * Zero runtime overhead (macro-generated code) * Built on `rumqttc`, so reliability &amp; performance stay the same * Each topic gets its own subscriber → no giant manual match on raw strings **Code:** [https://github.com/holovskyi/mqtt-typed-client](https://github.com/holovskyi/mqtt-typed-client) **Crate:** [https://crates.io/crates/mqtt-typed-client](https://crates.io/crates/mqtt-typed-client) **Quick backstory:** I'm 51, spent \\~10 years programming in OCaml/F# before taking a 10-year break from coding. Started learning Rust just 3-4 months ago and got so excited about the type system that I dove into building this as my first library. ChatGPT/Claude helped me get back into \"coding shape\" quickly — I used them as a senior/junior pair programmer for code reviews and explaining unfamiliar concepts, but wrote all the code myself. Been using it in production for a few months now — makes MQTT much less painful. Would love feedback, ideas, and real-world use cases! **Also curious — would the community be interested in a post about transitioning from OCaml/F# to Rust, especially the experience of getting back into programming after a long break with AI assistance?**",
      "author": "holovskyi",
      "timestamp": "2025-09-24 20:21:47",
      "url": "https://reddit.com/r/rust/comments/1npankz/typed_mqtt_client_in_rust_compiletime_topic/",
      "metadata": {
        "domain": "self.rust",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "rust",
      "score": 18,
      "num_comments": 6,
      "upvote_ratio": 0.95,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n06wu2",
      "title": "My MQTT Meshtastic bot can now send and receive email!",
      "content": "If anyone still cares :) Thanks for all the feedback in the first post (even if most of it was negative). I promise I am not polluting public airwaves. I have literally locked two nodes in an old fridge for testing. The new functionality works through a gmail account which i am accessing through API. MQTT server detectes /email &lt;recipient email&gt; &lt;subject&gt; then asks for email body. The email goes to the gmail accout and gets sent. The bot starts monitoring for any replies which if any get forwarded back to the user. I am having some issues with proper email chaining but the system is functioning and can be used for things like emergencies. Up next: an SMS gateway which is even better in case of an emergency. At least in my country emergency number officially supports SMS. Doing SMS might require a paid API or SIM card with an actual cellular plan at the server location but i am willing to swallow some SMS costs if I can ultimately get the bot working and public for all who want/need it in my area. I am also doing my best to contribute to the physical network. I will be deploying a total of 5 nodes with beefy 8dbi antennas at varying locations in Sofia Bulgaria all set up as infrastructure repeaters with constant power supply for as long as they last.",
      "author": "taghack",
      "timestamp": "2025-08-26 08:00:39",
      "url": "https://reddit.com/r/meshtastic/comments/1n06wu2/my_mqtt_meshtastic_bot_can_now_send_and_receive/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 84,
      "num_comments": 31,
      "upvote_ratio": 0.93,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ip8ass",
      "title": "WTF is MQTT?",
      "content": "Hey everyone, I joined the community in the past few months, and am becoming more and more integrated with my home assistant green. I've been seeing a lot of tutorials here and YouTube, and a lot of people are mentioning MQTT as one of their favortie and even essential add-ons. With all of this research and people saying how aweomse it is, it still have no idea what it does lol. Can someone explain it to me like I'm 5? What does MQTT do that makes it so special? Why wouldn't I just use the built in automations? What sort of functionality or additional uses does it add? Thanks everyone and i look forward to continuing my smart home journey",
      "author": "Cats_are_Love_1979",
      "timestamp": "2025-02-14 19:12:48",
      "url": "https://reddit.com/r/homeassistant/comments/1ip8ass/wtf_is_mqtt/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 0,
      "num_comments": 24,
      "upvote_ratio": 0.21,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mikzb8",
      "title": "[BUG] MQTT Verification Failure? Whaaa?",
      "content": "The Android version of the Bambu Handy app is giving me the above error when I try to use it to check on the status of my A1 Mini. Anyone else seeing this?",
      "author": "Vaygrim",
      "timestamp": "2025-08-06 04:50:21",
      "url": "https://reddit.com/r/BambuLab/comments/1mikzb8/bug_mqtt_verification_failure_whaaa/",
      "metadata": {
        "domain": "self.BambuLab",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuLab",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 0.83,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1na285y",
      "title": "MQTT Sensors becoming \"Not Provided\"",
      "content": "I've created some MQTT sensors in my HA config. Initially everything appeared to be working correctly but now HA reports all sensors as \"Not Provided\" and I'm not really sure what to do next. I can see that the sensors are still reporting in in MQTT explorer. I came across [this](https://www.reddit.com/r/homeassistant/comments/ywtd3g/what_makes_an_mqtt_sensor_go_unavailable/) topic but as the user points out there the docs suggest I shouldn't need to set *expire_after* or *availability_mode* as the defaults should be sufficient to keep the sensors last state as the active state until a new state is reported right? So if that is the case what gives? What do I need to do to keep the sensors last state? They still show up as entities under MQTT but with an error for each: https://imgur.com/fmxTysh Anyone familiar with MQTT wanna help a newbie out? Here is my sensors.yaml file: https://pastebin.com/U8rV52U7 and I have it called in configuration.yaml: sensors: !include sensors.yaml EDIT: Ok I think this may have been of my own doing. I tried deleting the entities under the MQTT broker and realized they weren't getting re-added with a config reload or restart. So I moved the sensor declarations back into the main file and now they have re-appeared and seem to be working again. I did some googling and it sound's like there is a current and legacy way to declare sensors and I'm doing it the legacy way (instead of using template:).",
      "author": "real_weirdcrap",
      "timestamp": "2025-09-06 23:21:03",
      "url": "https://reddit.com/r/homeassistant/comments/1na285y/mqtt_sensors_becoming_not_provided/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 2,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ixyzq2",
      "title": "I'm made a screen saver that displays all my MQTT data as the matrix code.",
      "content": "",
      "author": "melancholytron",
      "timestamp": "2025-02-26 00:26:23",
      "url": "https://reddit.com/r/homeassistant/comments/1ixyzq2/im_made_a_screen_saver_that_displays_all_my_mqtt/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 2034,
      "num_comments": 200,
      "upvote_ratio": 0.98,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nkaqfc",
      "title": "Counter-Strike as a Home Assistant MQTT device",
      "content": "# [cs2mqtt](https://github.com/lupusbytes/cs2mqtt) EDIT: It's now possible to install cs2mqtt directly on Home Assistant OS as an add-on using the link: [https://my.home-assistant.io/redirect/supervisor\\_add\\_addon\\_repository/?repository\\_url=https%3A%2F%2Fgithub.com%2Flupusbytes%2Fcs2mqtt](https://my.home-assistant.io/redirect/supervisor_add_addon_repository/?repository_url=https%3A%2F%2Fgithub.com%2Flupusbytes%2Fcs2mqtt) Thanks to u/kore69 Intro: In the beginning of 2024, I was searching for Home Assistant integrations to allow me to control my lights and other fun stuff, based on game state in Counter-Strike 2. I found [homeassistant-csgo](https://github.com/lociii/homeassistant-csgo), but the developer had marked it as deprecated and asked his users to move on to his Overwolf based integration. I do not want to install Overwolf on my PC and I also found that there was much more data available that I wanted to access, but that his integration didn't expose in Home Assistant, so I decided to build my own. Enter **cs2mqtt:** This project has a completely different approach, which is to accept data from the [Counter-Strike Game State Integration](https://developer.valvesoftware.com/wiki/Counter-Strike:_Global_Offensive_Game_State_Integration) engine on a high performance API and asynchronously re-transmit the data as MQTT messages on seperate topics and use the [MQTT discovery protocol](https://www.home-assistant.io/integrations/mqtt/#mqtt-discovery) to automatically create MQTT devices in Home Assistant, for every connected STEAM account. **cs2mqtt** is designed to run as docker container and can be hosted on your gaming PC, a separate server such as a Raspberry Pi or just on the same hardware as your Home Assistant server. The container only uses about 70MB RAM and in my benchmarks, on my own server, with simulated data from Counter-Strike, it can handle over 10000 requests per seconds. I have been using it myself for over a year now and I'm very happy with, so I decided to share it here with you guys. You can find the code and docs over at [https://github.com/lupusbytes/cs2mqtt](https://github.com/lupusbytes/cs2mqtt)",
      "author": "LupusOnFire",
      "timestamp": "2025-09-18 23:03:53",
      "url": "https://reddit.com/r/homeassistant/comments/1nkaqfc/counterstrike_as_a_home_assistant_mqtt_device/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 1277,
      "num_comments": 113,
      "upvote_ratio": 0.98,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1lacfne",
      "title": "Self-made smart home display made with A2-Mode/HTML/ABMT/MQTT/Raspberry Pi/Github",
      "content": "I made a smart home status display. It uses a modified version of papertty (https://github.com/rapidpt/papertty\\_fast) to enable the faster A2-Mode and sync the refresh to the full second to allow a proper clock display. A virtual X11 server is used to render a HTML-Page via Chromium and share the image via VNC to papertty(see github link). The HTML-Page connects via a REST-API to an ABMT-Model that collects all the data via MQTT, database and other channels. The display it self is a 9.7 inch screen from waveshare with a resolution of 1200 × 825 that cost me about 140€ last year. It is connected to a Raspberry Pi at the back, which is the backbone of my smart home system...",
      "author": "rapidprototrier",
      "timestamp": "2025-06-13 18:24:36",
      "url": "https://reddit.com/r/eink/comments/1lacfne/selfmade_smart_home_display_made_with/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "eink",
      "score": 1622,
      "num_comments": 30,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1kghojg",
      "title": "I learned A LOT about MQTT today...",
      "content": "My Button+ finally arrived from the Netherlands - after being stuck in US Customs thanks to... events... - so I've been trying to understand how MQTT works. The buttons trigger automations and, as everything is based on MQTT messages, responses are lighting fast. Highly recommended if you don't mind tinkering, as the device is really great. I'm on to configuring LED behaviors now, which is a little bit more difficult. Might update when the config is complete...",
      "author": "AmazingPlatform9923",
      "timestamp": "2025-05-07 06:28:09",
      "url": "https://reddit.com/r/homeassistant/comments/1kghojg/i_learned_a_lot_about_mqtt_today/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 634,
      "num_comments": 77,
      "upvote_ratio": 0.98,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1lhrcun",
      "title": "A fully open-source electromechanical 7-segment display with an onboard ESP32 — works perfectly with Home Assistant via MQTT",
      "content": "",
      "author": "Sokolsok",
      "timestamp": "2025-06-23 00:00:35",
      "url": "https://reddit.com/r/homeassistant/comments/1lhrcun/a_fully_opensource_electromechanical_7segment/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 437,
      "num_comments": 89,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1i3gq1t",
      "title": "Why you should care about Bambu Labs removing third-party printer access, and what you can do about it",
      "content": "Many of you will already be aware of [Bambu Labs' recent announcement](https://blog.bambulab.com/firmware-update-introducing-new-authorization-control-system-2/). tl;dr: A firmware update scheduled for January 23rd will remove the ability of third-party software such as Orca Slicer or the Panda Touch to connect directly to your printer. Users of third-party slicers will have to export sliced files and load them in a new \"Bambu Connect\" app in order to start prints or manage the printer. # Why you should care Open-source collaboration has driven the rapid advancement of 3D printing, enabling companies like Bambu Lab to produce reliable, consumer-grade printers. While Bambu Lab has taken a more closed approach than other manufacturers, they’ve supported third-party integrations and open access in meaningful ways, such as their work on Bambu Studio, a PrusaSlicer fork, and MQTT endpoints for monitoring. However, their decision to block third-party software access to their printers via a firmware update is a stark departure from this collaborative spirit. This change threatens the fundamental freedoms of hobbyists and professionals who depend on interoperability and flexibility. From here it's a small step to making the firmware mandatory and prohibiting downgrades, after which Bambu Lab gets a veto over anything you want to do with **your** printer. The workaround provided, Bambu Connect, adds additional overhead and difficulty to the process of printing for anyone not using Bambu Studio, is closed-source, and is not even feature complete: Linux support is \"Under Development\", so anyone using Orca Slicer on Linux is simply out of luck for now. Video streaming is also not yet supported, so anyone using a third-party slicer can no longer benefit from one of the major features of their printer. In short, this change has absolutely no benefit for end-users. It's anti-consumer and represents a reduction of functionality in your printer. Further, it sets the stage for further changes that limit how you may use your printer, such as enforcing model licensing restrictions on-device and preventing third-party development of labor-saving enhancements such as the Panda Touch. # What you can do about it The Internet's history is littered with events like this, where a company attempts to roll-back the functionality of their devices in service to their own goals and counter to their customers' wishes. In many of these cases, consumer outcry and concrete action such as those outlined below have convinced these companies that remaining open for innovation is the better pathway. 1. Don't update your printer's firmware: Bambu will likely be tracking download and installation counts. Make it clear you won't run this firmware. 2. Contact Bambu Lab: Politely express your concerns using their [support portal](https://bambulab.com/en/my/support/general-inquiry). Make it clear that you value open access and will not accept this change. 3. Vote with Your Wallet: Pause any purchases of Bambu Lab products or consumables and consider alternatives. If the change goes through, weigh selling your printer or avoiding updates. 4. Withdraw Your Support on MakerWorld: If you’re a creator, remove or relocate your models to other platforms and consider cashing out exclusive points. 5. Spread the Word: Share this issue widely to ensure others are informed and can join the pushback. # Contact Bambu Lab The first thing you should do is make Bambu Lab aware that you're not willing to accept this change. [Open a support ticket here](https://bambulab.com/en/my/support/general-inquiry) and let them know - politely - that you object to this change. It's most effective if you use your own words, but if you'd rather, here's a template you can start from: &gt;I’m writing to express my objection to the recently announced decision to block third-party software from accessing Bambu Lab printers. &gt;As a proud owner of the \\[model\\], I chose Bambu Lab for its quality and its openness to innovation. Restricting software access would diminish the flexibility and functionality of my printer, negatively impacting my experience as a user. &gt;Should this change proceed, I will not update my printer's firmware and will reconsider purchasing Bambu Lab products in the future. I urge you to reconsider this decision and maintain open access, which has been a hallmark of 3D printing innovation. Include as appropriate: &gt;I am also a creator on MakerWorld, with x total downloads and y boosts, having earned z points across my models, which brings significant value to the Bambu Lab ecosystem. Should this change go ahead, I intend to move all my models to other hosting services as soon as any exclusivity period is over. All my future models will be uploaded elsewhere and not mirrored to MakerWorld. \\[Furthermore, I intend to redeem my \\[x\\] exclusive points for cash and close my account.\\] \\-- &gt;I have frequently purchased your filaments for the quality and convenience they offer. However, in light of this change I will be seeking out alternative suppliers for my consumable needs. \\-- &gt;I am responsible for making purchasing decisions for my \\[school | educational institution | workplace\\], and in light of this change I will no longer be able to recommend Bambu Labs' products for our use, forcing us to seek out alternatives with your competitors. # Stop buying their stuff Voting with our pockets is an incredibly powerful tool to demonstrate that this change will not come without a cost. There are many excellent manufacturers of filament out there - stop buying Bambu's filament. Don't buy more Bambu Lab printers until they agree to cancel or roll-back this change. If this is important enough to you, commit to selling your printer if this change is pushed through, or at the point where a firmware upgrade is made mandatory or limits you from using significant new features. Unfortunately, most of us are here because Bambu Labs' printers are significantly better than the competition - but a high quality printer that can only be used in ways the manufacturer deems acceptable is as bad as no printer at all. If you've previously recommended Bambu Lab printers to others, or if you have control over purchasing decisions at a company or institution, consider finding alternatives. # Withdraw your labour Many of us are creators who publish our models to MakerWorld. MakerWorld represents a significant boon to Bambu Lab: the presence of high quality models and the close integration with Bambu Studio and Bambu Handy enhances the usefulness of their printers, and the draw of simple click-to-print functionality acts as a significant incentive to people to choose to buy their hardware. Withdrawing your models from MakerWorld and uploading them elsewhere is a significant loss to Bambu Lab and the attractiveness of MakerWorld and thus their hardware. If you have exclusive points, cashing them out for money rather than using them on vouchers imposes a meaningful financial cost on them as well. If enough makers credibly commit to doing this, the pressure alone will have a significant impact on their calculations when considering if they should go ahead with this change. If you're a maker and have models you're willing to withdraw, I'd encourage you to commit to doing so in your letter to Bambu Lab and in a comment below. Bear in mind that if you have models under the Exclusive program, you will need to wait 90 days since launch (or 14, in case of the launch exclusive option) before you can remove them and post them elsewhere. Finally, rather than deleting your listing, you may choose to remove the models and update the description to include a message explaining why you have taken them down, as well as linking your users to where they can now be found. # Spread the word Let others know that this is a fight worth having, and make them aware of the consequences of letting Bambu Lab limit what we can do with the printers we bought and own. Feel free to link to this post, or write your own explanation. Encourage others to take the actions outlined here. This isn't the first, tenth, or even hundredth time a company has tried to close their hardware like this. With sufficient pushback, and by demonstrating credibly that this will cost Bambu Lab customers, we can succeed in demonstrating that the costs of being closed are not worth whatever benefits they hope to derive by limiting their customers' options.",
      "author": "nickjohnson",
      "timestamp": "2025-01-17 21:48:33",
      "url": "https://reddit.com/r/BambuLab/comments/1i3gq1t/why_you_should_care_about_bambu_labs_removing/",
      "metadata": {
        "domain": "self.BambuLab",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuLab",
      "score": 7712,
      "num_comments": 1951,
      "upvote_ratio": 0.95,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n1o8ql",
      "title": "Billy Bassistant Update: Announce mode over MQTT command",
      "content": "Backstory for people that didn’t see my first post: Billy Bassistant is a talking Big Mouth Billy Bass powered by a Raspberry Pi and the OpenAI Realtime API, making realtime conversations possible. The new v1.4.0 update will include the MQTT Say command to be able to let Billy announce messages from Home Assistant (or any other custom Mqtt broker). Both literal messages, where Billy will repeat the sentence word for word, as well as prompt messages, where Billy will give his own twist on it based on his personality. This will open up a bunch of new possibilities where Billy can announce something ‘on his own’ (HA automations) without the need of someone pressing the physical button first. In the coming days I’ll continue to finalise this feature but in the meantime you could already check out the beta version on the Dev branch on Github: https://github.com/Thokoop/billy-b-assistant/tree/dev There you can also find the build instructions if you’d like to build one yourself. Let me know what you think :)",
      "author": "Thokoop",
      "timestamp": "2025-08-28 01:59:29",
      "url": "https://reddit.com/r/homeassistant/comments/1n1o8ql/billy_bassistant_update_announce_mode_over_mqtt/",
      "metadata": {
        "domain": "youtu.be",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 398,
      "num_comments": 45,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1j5oqce",
      "title": "I'm working on an MQTT screen saver that displays like the Matrix code.",
      "content": "",
      "author": "melancholytron",
      "timestamp": "2025-03-07 22:08:43",
      "url": "https://reddit.com/r/selfhosted/comments/1j5oqce/im_working_on_an_mqtt_screen_saver_that_displays/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "selfhosted",
      "score": 387,
      "num_comments": 55,
      "upvote_ratio": 0.95,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1em2ewg",
      "title": "Conveyor Poop Chute (Automatic poop detection with ESP32/MQTT)",
      "content": "",
      "author": "TonyZ-",
      "timestamp": "2024-08-07 12:07:32",
      "url": "https://reddit.com/r/BambuLab/comments/1em2ewg/conveyor_poop_chute_automatic_poop_detection_with/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuLab",
      "score": 458,
      "num_comments": 75,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1i36o3m",
      "title": "Bambu to roll out update. MQTT will still be allowed but(͡•_ ͡• )",
      "content": "This will allow us to only monitor and not pre heat any more if i understand correctly.",
      "author": "friday567",
      "timestamp": "2025-01-17 10:54:14",
      "url": "https://reddit.com/r/homeassistant/comments/1i36o3m/bambu_to_roll_out_update_mqtt_will_still_be/",
      "metadata": {
        "domain": "blog.bambulab.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 117,
      "num_comments": 93,
      "upvote_ratio": 0.96,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1i3gtio",
      "title": "MQTT Command Verification Failed",
      "content": "Turned on my X1C this morning and it said there was an update, I let it update as I usually do. Firmware version is now 01.08.03.00. Now I can control the printer locally via the screen but cannot control it via Studio, Handy or Ocra. I can connect to the printer and see and update filaments in the AMS, temps etc but cannot change the temps. If I send a print it goes up to the cloud OK and the screen swaps to the device tab and nothing happens. In HMS on the device tab it shows the fault above and there is a link to the BL wiki, I have no idea what MQTT is. The fault also says to update Studio which I have done to version 1.10.1.50 and it makes no difference. However I have searched the wiki and cannot find the code for the fault shown on the printer screen which is [0500-0500-0001-0007 123417]. I have rebooted several times. Would appreciate some help please.",
      "author": "distinctlyaverageuk",
      "timestamp": "2025-01-17 21:53:24",
      "url": "https://reddit.com/r/BambuLab/comments/1i3gtio/mqtt_command_verification_failed/",
      "metadata": {
        "domain": "self.BambuLab",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuLab",
      "score": 37,
      "num_comments": 116,
      "upvote_ratio": 0.92,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "11lb39s",
      "title": "Finally finished my night light… 3D printed, running Wemos D1 mini with digital LED strip, running as a mqtt thing on my home server. Can be controlled via phone/web.",
      "content": "",
      "author": "PraetorianCZE",
      "timestamp": "2023-03-08 04:57:00",
      "url": "https://reddit.com/r/NoMansSkyTheGame/comments/11lb39s/finally_finished_my_night_light_3d_printed/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "NoMansSkyTheGame",
      "score": 1054,
      "num_comments": 51,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "pq60i3",
      "title": "I wanted to get notified when my washing machine finished, so I made this device. It detects the beeps at the end of the wash and publishes a message via MQTT. More info in the comments.",
      "content": "",
      "author": "Straight_Hat",
      "timestamp": "2021-09-18 02:39:31",
      "url": "https://reddit.com/r/arduino/comments/pq60i3/i_wanted_to_get_notified_when_my_washing_machine/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "arduino",
      "score": 992,
      "num_comments": 82,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nhl2ty",
      "title": "MQTT as primary API for web app (instead of REST)",
      "content": "At my company, we decided to use MQTT instead of REST for the API behind our web application (Blazor server). It wasn't my decision - in fact, I didn't like the idea from the beginning - but I went along with it. After working with it for a while, I'm convinced it was the wrong choice. I've basically had to reimplement the ASP.NET Core pipeline for MQTT - request/response, routing, validation, authentication, middleware, filters, etc. Developer experience has been rough. With ASP.NET REST you get all of this for free thanks to years of ecosystem maturity, but with MQTT you're reinventing the wheel at every step. I understand MQTT is great for IoT. But for a standard web app, I don't see any real use case for it. Tooling is weaker (no Swagger, no Postman, fewer testing frameworks), onboarding new devs will be harder I guess. So we've created technical debt by rolling our own \"mini ASP.NET pipeline\", right? The project is only about a year old, greenfield, and not very active. That makes me think rewriting wouldn't be that hard - the endpoint handlers themselves wouldn't change much and could probably stay more or less the same. When I raise concerns internally, my colleagues don't see a problem. I'd like to know if I'm missing something, or if I should push harder for a rewrite to REST. So I'm curious: - Has anyone here actually made MQTT work well as a primary API layer for a web app? - If so, what patterns or tooling did you use to avoid re-inventing everything? - Would you recommend sticking with MQTT or moving toward REST? EDIT: Additional context: - The reason we're building this app is that the existing one relies on technologies that are end-of-life, and our customers require supported platforms. Since we are .NET developers, Blazor was chosen - both to modernize and to test if Blazor is a good fit for us. - This app is part of a larger suite where MQTT actually does make sense - we also work with IoT. That's probably the root of the idea to \"use MQTT\", but the message seems to have been miscommunicated and the decision was made to apply MQTT everywhere. What I still don't understand is why, after a year, there's no recognition that MQTT makes little sense as the API layer for a web application. - We really don't do anything fancy - just a simple web app. I can imagine that if we later decide to extend the app, both MQTT and REST could coexist, right? But I think it will not happen.",
      "author": "loric16",
      "timestamp": "2025-09-15 20:55:34",
      "url": "https://reddit.com/r/dotnet/comments/1nhl2ty/mqtt_as_primary_api_for_web_app_instead_of_rest/",
      "metadata": {
        "domain": "self.dotnet",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "dotnet",
      "score": 18,
      "num_comments": 40,
      "upvote_ratio": 0.91,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1e487iu",
      "title": "DIY Apple HomeKey with ESP32 &amp; MQTT",
      "content": "Hey Folks! I just want to share this awesome project. You can build your own own Apple HomeKey with an ESP32, a PN532 NFC Module V3 as just a tiny bit of sodering. This was my first sodering project ever. I’d just followed [this](https://github.com/rednblkx/HomeKey-ESP32) instructions. The only difference I made was, that I used the ESP online tool instead of installing it on my Mac. And now, i have my own HomeKey to trigger everything, not only Locks. Because you can add this device via MQTT to Home Assistant, you can trigger whatever you want :) So big shout out to [rednblkx](https://github.com/rednblkx) for this cool reverse engineered HomeKey!",
      "author": "Gizmify",
      "timestamp": "2024-07-16 06:26:53",
      "url": "https://reddit.com/r/homeassistant/comments/1e487iu/diy_apple_homekey_with_esp32_mqtt/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 195,
      "num_comments": 88,
      "upvote_ratio": 0.95,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mokvah",
      "title": "My newest fully open-source creation: an electromechanical 7-segment \"SHADOW\" display driven by an ESP32. It works completely standalone, or you can connect it to Home Assistant (or similar) to display data over MQTT.",
      "content": "",
      "author": "Sokolsok",
      "timestamp": "2025-08-13 05:01:00",
      "url": "https://reddit.com/r/homeautomation/comments/1mokvah/my_newest_fully_opensource_creation_an/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeautomation",
      "score": 232,
      "num_comments": 15,
      "upvote_ratio": 0.98,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1j4qu5t",
      "title": "I made an iOS dashboard for mqtt out of home assistant",
      "content": "I kind of find mqtt is my input/output of choice but wanted a small dashboard I could have on the side - kind of like eink but in colour . So .. I made a simple iOS app to read in mqtt feeds and show them in a range on framed styles. Just wondering if people are interested, if they are I will wrap it up on iOS and see if I can release it for free… Andy",
      "author": "digitalurban_casa",
      "timestamp": "2025-03-06 16:19:13",
      "url": "https://reddit.com/r/homeassistant/comments/1j4qu5t/i_made_an_ios_dashboard_for_mqtt_out_of_home/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 260,
      "num_comments": 34,
      "upvote_ratio": 0.94,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1myexq4",
      "title": "I made a MQTT Meshtastic bot",
      "content": "The bot can currently relay any question to Google Gemini AI and forward the response. It keeps conversation context. It can also give you weather forecasts for your node's GPS location (if available) or a manually inserted set of GPS coordinater or a City name. I plan on adding other features like an email forwader that forwards a message from you to an email address from a temp email and then monitors for a response email to send back to you through meshtastic. I am also exploring forwarding messages to SMS. If anybody has any interest in the project i can host it on github and do a write-up on how to configure a gateway node and your own MQTT server.",
      "author": "taghack",
      "timestamp": "2025-08-24 06:25:00",
      "url": "https://reddit.com/r/meshtastic/comments/1myexq4/i_made_a_mqtt_meshtastic_bot/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 32,
      "num_comments": 35,
      "upvote_ratio": 0.65,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mpf1my",
      "title": "Open-Source electromechanical 7-segment \"Shadow\" display with an onboard ESP32 — works perfectly with Home Assistant via MQTT",
      "content": "",
      "author": "Sokolsok",
      "timestamp": "2025-08-14 04:05:05",
      "url": "https://reddit.com/r/homeassistant/comments/1mpf1my/opensource_electromechanical_7segment_shadow/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 201,
      "num_comments": 14,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1i51xrg",
      "title": "Is it end of bambu lab era?",
      "content": "I've seen that bambu lab is doing a lot of shitty anti consumer practices like closing their API, banning users complaining about their firmware etc. (Like they are in competition with HP). Is it time to buy something else like Prusa? Ps. Bambu mods don't ban me UPDATE: Bambu Lab seems to listen and posted a blog post that says that you can enable developer lan only mode that exposes MQTT protocol and returns normal functionality! [https://blog.bambulab.com/updates-and-third-party-integration-with-bambu-connect/](https://blog.bambulab.com/updates-and-third-party-integration-with-bambu-connect/)",
      "author": "Anxious-Resolve-8827",
      "timestamp": "2025-01-20 00:11:47",
      "url": "https://reddit.com/r/3Dprinting/comments/1i51xrg/is_it_end_of_bambu_lab_era/",
      "metadata": {
        "domain": "self.3Dprinting",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "3Dprinting",
      "score": 1341,
      "num_comments": 964,
      "upvote_ratio": 0.85,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1j7q7t8",
      "title": "How many of you use MQTT vs HTTP vs ???",
      "content": "I'm a complete embedded newbie but I'd love to understand which communication protocol is used most in your embedded projects. Have you seen any trends away from/towards particular protocols in recent years?",
      "author": "packbacking",
      "timestamp": "2025-03-10 12:06:11",
      "url": "https://reddit.com/r/embedded/comments/1j7q7t8/how_many_of_you_use_mqtt_vs_http_vs/",
      "metadata": {
        "domain": "self.embedded",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "embedded",
      "score": 54,
      "num_comments": 62,
      "upvote_ratio": 0.9,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mj6xcv",
      "title": "Remove MQTT validation ot have better system for slicers like orca slicer (Authorization Control)",
      "content": "I rely on the cloud and can't switch to lan mode since I remotely control outside lan alot, and use bambu handy to view camera outside of my house. This update has rolled over to the A1 now, and I am still very unsatisfied. I have downgraded my printers version back to .4 untill you add a better system for 3rd party tools besides the bambu Connect app, which barely gives control. Please still allow 3rd party software to use cloud.",
      "author": "DinoHawaii2021",
      "timestamp": "2025-08-06 22:57:50",
      "url": "https://reddit.com/r/BambuLab/comments/1mj6xcv/remove_mqtt_validation_ot_have_better_system_for/",
      "metadata": {
        "domain": "self.BambuLab",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuLab",
      "score": 24,
      "num_comments": 35,
      "upvote_ratio": 0.79,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mire9z",
      "title": "MQTT Command Verification",
      "content": "I keep getting this message on all 3 of my printers. It doesn't matter if I send a print from the Handy app or the desktop slicer. This keeps appearing. I know someone's figured this one out already, I've tried the steps provided by BL but it isn't working.",
      "author": "Strange_Awareness127",
      "timestamp": "2025-08-06 09:20:58",
      "url": "https://reddit.com/r/BambuLab/comments/1mire9z/mqtt_command_verification/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuLab",
      "score": 25,
      "num_comments": 32,
      "upvote_ratio": 0.92,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1lq2wy1",
      "title": "My latest fully open-source project: an electromechanical 7-segment display powered by an ESP32. It can run completely on its own or hook up to something like Home Assistant and show info over MQTT.",
      "content": "",
      "author": "Sokolsok",
      "timestamp": "2025-07-03 02:07:13",
      "url": "https://reddit.com/r/homeautomation/comments/1lq2wy1/my_latest_fully_opensource_project_an/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeautomation",
      "score": 157,
      "num_comments": 20,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1id5xq2",
      "title": "Where's that rocket going? ( Factorio + Rimworld modded to trigger via MQTT )",
      "content": "",
      "author": "Zeeterm",
      "timestamp": "2025-01-30 06:00:52",
      "url": "https://reddit.com/r/factorio/comments/1id5xq2/wheres_that_rocket_going_factorio_rimworld_modded/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "factorio",
      "score": 245,
      "num_comments": 32,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "t2ljcq",
      "title": "Raspberry Pi CM4 automated morning coffee alarm clock using OmniKit, \"Alarm MQTT\" APP, Python3 MQTT client, and Relay.",
      "content": "",
      "author": "Zontexo",
      "timestamp": "2022-02-27 18:34:38",
      "url": "https://reddit.com/r/raspberry_pi/comments/t2ljcq/raspberry_pi_cm4_automated_morning_coffee_alarm/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "raspberry_pi",
      "score": 977,
      "num_comments": 50,
      "upvote_ratio": 0.96,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mh81uh",
      "title": "MQTT error following Handy update",
      "content": "just updated Handy to the latest 3.4.1 version on two smart devices and now they both have the MQTT error to my P1S, also running latest 1.08.02.00 software. tried powercycling devices, logging out and back into account, clean reinstall of app, and powercycling the printer several times. everything on the same wifi network, and was all working fine literally 10 mins before the app update. thanks, Bambu. test your goddamn code before you push it.",
      "author": "mediweevil",
      "timestamp": "2025-08-04 16:39:32",
      "url": "https://reddit.com/r/BambuLab/comments/1mh81uh/mqtt_error_following_handy_update/",
      "metadata": {
        "domain": "self.BambuLab",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuLab",
      "score": 10,
      "num_comments": 30,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1j2112g",
      "title": "GitHub - bunkeriot/BunkerM: 🚀 BunkerM: All-in-one Mosquitto MQTT broker with Web UI for easy management, featuring dynamic security, role-based access control, monitoring, API and cloud integrations",
      "content": "",
      "author": "mcttech",
      "timestamp": "2025-03-03 04:48:28",
      "url": "https://reddit.com/r/homeassistant/comments/1j2112g/github_bunkeriotbunkerm_bunkerm_allinone/",
      "metadata": {
        "domain": "github.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 114,
      "num_comments": 40,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "qgqcxq",
      "title": "Created a nice housing for my Raspberry pi MQTT client!",
      "content": "",
      "author": "Disasterhawk",
      "timestamp": "2021-10-27 14:37:34",
      "url": "https://reddit.com/r/raspberry_pi/comments/qgqcxq/created_a_nice_housing_for_my_raspberry_pi_mqtt/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "raspberry_pi",
      "score": 856,
      "num_comments": 51,
      "upvote_ratio": 0.98,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1iaabql",
      "title": "is MQTT a lot of maintenance?",
      "content": "So just starting out with HA don't have any zigbee equipment set up yet so still on the fence to do ZHA or 2MQTT - whats the general thoughts out there? I feel like 2MQTT is the popular kid on the block but is there a lot of maintenance when updates release - whats the general pros and cons of each",
      "author": "aldojack",
      "timestamp": "2025-01-26 17:36:43",
      "url": "https://reddit.com/r/homeassistant/comments/1iaabql/is_mqtt_a_lot_of_maintenance/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 12,
      "num_comments": 61,
      "upvote_ratio": 0.73,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mzbj1j",
      "title": "Are these compatible with MQTT?",
      "content": "I am unable to get them to be discovered in with ZigbeeMQTT. Is this not possible?",
      "author": "MTBRider4Fun",
      "timestamp": "2025-08-25 07:54:54",
      "url": "https://reddit.com/r/homeassistant/comments/1mzbj1j/are_these_compatible_with_mqtt/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 0,
      "num_comments": 23,
      "upvote_ratio": 0.36,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1hkklfr",
      "title": "CAN vs MQTT: Best Protocol for a Reliable and Secure Shelved Room System?",
      "content": "I'm planning a communication system within a closed room (variable but should work up to 10x10m) filled with shelves, connecting up to 10–40 nodes distributed over the shelves to a central processing unit, would CAN or MQTT be the better choice? (The system will have to be CE-certified). Key details and criteria are: 1. Environment and Layout: * The room has minimal external interference or noise sources. * The nodes sit in the shelves and need to transmit simple sensor data only when a state changes. * To ensure full coverage, the total cable length for CAN could reach up to 80m, given a potential serpentine cable routing cable layout. 2. Reliability and Security: * The system must be reliable for transmitting data without loss. When a change occurs it has to be received by the central processing unit in under 1 second, losses would be fatal. * Security against hacking or tampering is crucial. 3. Modularity and Scalability: * Nodes must be modular, with connectors allowing easy plugging and unplugging. The cables would run in the floor with sockets for plugging in nodes, if there is a shelve at the respective location. The layout of the shelves and therefore nodes might change sometimes, but not too often (like 1-2 times a year). * The system will be used in rooms of different size from 3x6m to 10x10m. But all rooms should run with the same system. 4. My thoughts: * CAN comes with higher hardware and cabling complexity, potentially reducing modularity. * MQTT is more flexible and easier to set up but may require WiFi networking, leading to higher power consumption, increased security concerns, and possibly more expensive CE certification. Given these factors, which protocol would be more suitable for this setup, and what are the trade-offs to consider in terms of implementation complexity, scalability, reliability, and security?",
      "author": "zokii_",
      "timestamp": "2024-12-23 17:58:10",
      "url": "https://reddit.com/r/embedded/comments/1hkklfr/can_vs_mqtt_best_protocol_for_a_reliable_and/",
      "metadata": {
        "domain": "self.embedded",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "embedded",
      "score": 20,
      "num_comments": 63,
      "upvote_ratio": 0.81,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nilyt3",
      "title": "I wonder why MQTT constantly disconnects...",
      "content": "",
      "author": "Gnarlodious",
      "timestamp": "2025-09-17 00:17:08",
      "url": "https://reddit.com/r/meshtastic/comments/1nilyt3/i_wonder_why_mqtt_constantly_disconnects/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 1,
      "num_comments": 17,
      "upvote_ratio": 0.67,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nlwmwj",
      "title": "Database for MQTT persistence",
      "content": "I am using Mosquitto MQTT with a few Python apps that gather data from multiple IoT devices and their job is to store telemetry data into SQL Server. Each Python app is responsible for one Database. Different databases is for different device groups. Problem: Even though all Python apps are subscribe with clean session False (Persistence) I have seen more than twice data being lost due to multiple reasons. Server goes down and Python service did not start up. Or Broker goes down and all subscriptions are lost. All of the above causes data loss. Solution: I have found EMQX Broker has a database connector and you basically bind a topic into the database and everything published there is stored into the database. Which is exactly what I want. I tried that with SQL Server and MongoDB. Both worked. From what I understand I will need to do a buffering into a database. Then my services will read that database and parse and move the data into SQL Server databases. I think using SQL Server for that is not a good solution cause I only need is a FIFO operation. Question: What is the best database for FIFO operations?",
      "author": "ThreeGreenBirds",
      "timestamp": "2025-09-20 20:15:16",
      "url": "https://reddit.com/r/selfhosted/comments/1nlwmwj/database_for_mqtt_persistence/",
      "metadata": {
        "domain": "self.selfhosted",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "selfhosted",
      "score": 2,
      "num_comments": 16,
      "upvote_ratio": 0.67,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1ny1hw6",
      "title": "Low-cost, open source MQTT brokers with cluster/HA mode?",
      "content": "We have a mix of MQTT deployments for our IOT infrastructure, Mosquitto and older EMQX in single node mode (before they changed the license). We're looking to retire Mosquitto services and expand EMQX to cluster mode. *MQTT V5 support and high availability are our main requirements.* EMQX and HiveMQ both requires expensive enterprise licenses for self-hosting. RabitMQ and VerneMQ seem like viable alternatives. Do you have experience with them in cluster mode? What are my options here? Many thanks!",
      "author": "green_mozz",
      "timestamp": "2025-10-05 02:25:33",
      "url": "https://reddit.com/r/devops/comments/1ny1hw6/lowcost_open_source_mqtt_brokers_with_clusterha/",
      "metadata": {
        "domain": "self.devops",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "devops",
      "score": 14,
      "num_comments": 12,
      "upvote_ratio": 0.94,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nc0bde",
      "title": "MQTT &amp; Rockwell",
      "content": "I have a Compactlogix 5380 5069-L310ER. How can I connect this to an MQTT broker? I have a mosquito broker set up to test some stuff and I have been struggling to actually get a message or trigger through. Do i need a specialized Module? Any tips/tricks?",
      "author": "Spud_man101",
      "timestamp": "2025-09-09 05:23:14",
      "url": "https://reddit.com/r/PLC/comments/1nc0bde/mqtt_rockwell/",
      "metadata": {
        "domain": "self.PLC",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "PLC",
      "score": 4,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nwg4em",
      "title": "How to publish Mqtt out of esphome/a device itself?",
      "content": "Hello everyone... I have 2 vue 2 with esphome in an ha environment and need to publish some values via mqtt and preferably without time delay... I was able to do it out of HA as an automation but the values are coming to slow. So i am hoping that when i publish it from inside the device/esphome, i might be able to get them faster or even in real time... How can that be done? I found so far stuff like this: &gt;`platform: emporia_vue:` `name: \"energymonitor1_total_power_2\"` `id: outside_temp` `oversampling: 16x #(what does oversampling actually do?)` `on_value: - mqtt.publish: topic: \"homeassistant/sensor/energymonitor1_total_power_2/state\"` `payload: !lambda |` `- return to_string(id(energymonitor1_total_power_2).state);` But I tried al lot and was unable to publish. Can someone hint me how I could publish the values total\\_voltage (clamp a + clamp b) and total\\_power via mqtt? And if possible without slowed down publication...real-time would be perfect... Thx for any intel",
      "author": "Particular_Ferret747",
      "timestamp": "2025-10-03 05:08:30",
      "url": "https://reddit.com/r/Esphome/comments/1nwg4em/how_to_publish_mqtt_out_of_esphomea_device_itself/",
      "metadata": {
        "domain": "self.Esphome",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Esphome",
      "score": 0,
      "num_comments": 12,
      "upvote_ratio": 0.43,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "yqz2lo",
      "title": "Pimoroni Galactic Unicorn - Mqtt Scroller and 3D printed case with pi picow built in .",
      "content": "",
      "author": "digitalurban_casa",
      "timestamp": "2022-11-10 07:31:19",
      "url": "https://reddit.com/r/raspberry_pi/comments/yqz2lo/pimoroni_galactic_unicorn_mqtt_scroller_and_3d/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "raspberry_pi",
      "score": 618,
      "num_comments": 42,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n1yy2u",
      "title": "Wiz! Why is your software garbage? MQTT error?",
      "content": "I made thevmistake of buying your light bulbs last year (everyone do yourselves a favor and just purchase the more expensive ones that dont rely on wiz). It was a pain to connect them the first time around, and documentation is limited. Had to use ChatGPT just to figure out how to delete a device. Well, now, I recently updated my wifi router and I got two light bulbs to work, one to kinda connect, and another three that will continue to report MQTT connection errors and wont pair through the app. It shouldn't be this frustrating. What gives!?",
      "author": "TheGuyWithThePotato",
      "timestamp": "2025-08-28 09:14:27",
      "url": "https://reddit.com/r/wiz/comments/1n1yy2u/wiz_why_is_your_software_garbage_mqtt_error/",
      "metadata": {
        "domain": "self.wiz",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "wiz",
      "score": 12,
      "num_comments": 13,
      "upvote_ratio": 0.78,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1llmpkt",
      "title": "MQTT command verification failed. How to fix?",
      "content": "Recently got this message. Both the app and slicer are up to date. I only use Bambu Slicer. Deleted both slicer and app and the issue still persists.",
      "author": "H0neyDews1",
      "timestamp": "2025-06-27 14:15:54",
      "url": "https://reddit.com/r/BambuLab/comments/1llmpkt/mqtt_command_verification_failed_how_to_fix/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuLab",
      "score": 4,
      "num_comments": 24,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n4x9m4",
      "title": "Marstek und mqtt...?!",
      "content": "Tja, Dinge passieren. Ich hab aktuell zwei Speicher B2500 D einer mit Extension Anschluss einer ohne. Der mit hat Firmware 108.7 bzw. 110.9, der ohne 116.6. Seit 4 Wochen ist es aber nun so, und das ist offensichtlich unabhängig von der Firmware Version, dass wenn die Speicher per mqtt an den Home Assistant senden, nach 3 Minuten die entlademengr auf 0 gesetzt wird. Sage ich dem Home Assistant eine falsche Adresse, geht es ungefähr eine Stunde. Setze ich den mqtt via tomquist ble tool das mqtt im Speicher zurück geht es so halbwegs. Tja, wodran liegt es? Ist es bei euch auch so? Irgendwelche Lösungen? Kommunikationsmodul ist eine 2023 Firmware Version",
      "author": "AlSi10Mg",
      "timestamp": "2025-08-31 23:12:57",
      "url": "https://reddit.com/r/Balkonkraftwerk/comments/1n4x9m4/marstek_und_mqtt/",
      "metadata": {
        "domain": "self.Balkonkraftwerk",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Balkonkraftwerk",
      "score": 2,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1muzwtu",
      "title": "What’s the most useful thing you’ve used MQTT for?",
      "content": "Hello everyone, I’ve recently began delving into the abstractMQTTdriver on board Honeywells N4 and I’ve been able to set up a TLS connection with the broker, I’ve published and subscribed plenty via powershell commands and proven the case. Im trying to avoid the json and html drivers to avoid extra licensing (though I haven’t looked up the price) so this is my work around. I know a bit of Java and python, but the way I understand it is I need to either parse the json to fit the rules set of MQTT or it (whatever application I’m pulling metadata from)needs to have MQTT (which is scarce from what I understand) I’m open to any ideas, and welcome any more knowledge I’m sure there are more nuances the deeper I dive. My end goal is to pull data from APIs and legacy systems over to our front-end. I’m soloing this so yeah any direction is welcomed.",
      "author": "Sad-Selection7784",
      "timestamp": "2025-08-20 08:21:22",
      "url": "https://reddit.com/r/BuildingAutomation/comments/1muzwtu/whats_the_most_useful_thing_youve_used_mqtt_for/",
      "metadata": {
        "domain": "self.BuildingAutomation",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BuildingAutomation",
      "score": 9,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nwdey2",
      "title": "Tesla Data Logging on Raspberry Pi with AI Assistance from Grok – Easy Integration with Home Assistant via MQTT!",
      "content": "Hey r/homeassistant community, I've been tinkering with ways to pull real-time data from my Tesla (like battery level, charging state, odometer, and location) and feed it into Home Assistant for better automation and monitoring. With some help from Grok (the AI from xAI), I put together a two-part guide on setting this up using a Raspberry Pi and the Tesla Fleet API. It's straightforward, cost-effective, and leverages MQTT for seamless HA integration. \\*\\*Part 1: Environment Setup\\*\\* This covers the basics to get your Pi ready: \\- Grabbing a domain and pointing it to your Pi (handles dynamic IPs too). \\- Setting up Nginx as a reverse proxy. \\- Configuring FastAPI for handling Tesla's OAuth callbacks. \\- Securing everything with free SSL certs from Let's Encrypt. \\- Registering on the Tesla Developer Portal and generating keys. Grok was a game-changer here – it provided exact commands, configs, and troubleshooting tips tailored to my setup. No more endless Googling! \\[Read Part 1 here\\](https://homatica.cc/blog/raspberry-pi-tesla-logging-part-1) \\*\\*Part 2: Implementing the Logging Script\\*\\* Building on Part 1, this dives into the \\`tesla\\_mqtt\\_logger.py\\` script: \\- Managing access tokens and refreshing them automatically. \\- Waking your Tesla if it's asleep and polling data every 15 minutes. \\- Outputting data to MQTT topics (perfect for HA sensors/entities) or CSV if you prefer local logging. \\- Running it as a systemd service for reliability. Again, Grok helped craft the script, handle edge cases like API errors, and optimize for Pi hardware. The MQTT output means you can easily create custom dashboards or automations in Home Assistant – think notifications for low battery or geofencing triggers. \\[Read Part 2 here\\](https://homatica.cc/blog/grok-raspberry-pi-tesla-logging-part-2) If you're into EVs, home automation, or just Raspberry Pi projects, check these out! I'd love feedback, questions, or if anyone has tweaks for better HA integration. Has anyone else logged Tesla data this way? Thanks! 🚀",
      "author": "coderlogic",
      "timestamp": "2025-10-03 03:29:02",
      "url": "https://reddit.com/r/homeassistant/comments/1nwdey2/tesla_data_logging_on_raspberry_pi_with_ai/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 0,
      "num_comments": 7,
      "upvote_ratio": 0.3,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1m4n9ue",
      "title": "Zabbix MQTT plugin doesn't work at all",
      "content": "Hey everyone! So I'm very new to zabbix but part of my project is creating a zabbix-mqtt based monitoring system. For this I've created a fresh installation of zabbix 7.4. I've followed the official mqtt plugin guide but it's not very comprehensive. First I configured a Host: https://preview.redd.it/vzlh4ludr0ef1.png?width=1538&amp;format=png&amp;auto=webp&amp;s=ed968c9baf8183ca5309b06687164032a94c5968 Then I went ahead and configured a device under it named : \"devices\" that represents the \"devices\" topic: https://preview.redd.it/56drwjxhr0ef1.png?width=1582&amp;format=png&amp;auto=webp&amp;s=8bb9aa86456d7acc6cc24e52a77689705ae9e12e Here's the configuration I added to the zabbix\\_agent2.conf file in accordance with the official mqtt plugin docs: \"Plugins.MQTT.Timeout=5 Plugins.MQTT.Sessions.railway\\_broker.Url=tcp://localhost:1883 Plugins.MQTT.Sessions.railway\\_broker.Topic=devices/ Plugins.MQTT.Sessions.railway\\_broker.User=ctv Plugins.MQTT.Sessions.railway\\_broker.Password=xxx\" Unfortunately, there's no indication from the agent nor the broker logs of any interaction between the two. Any help would be greatly appreciated!",
      "author": "idanzhavi09",
      "timestamp": "2025-07-20 20:05:00",
      "url": "https://reddit.com/r/zabbix/comments/1m4n9ue/zabbix_mqtt_plugin_doesnt_work_at_all/",
      "metadata": {
        "domain": "self.zabbix",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "zabbix",
      "score": 2,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nry8mb",
      "title": "Govee 2 MQTT Broken.",
      "content": "Hello All. I have been using Govee 2 MQTT and it seems to have been broken lately, I am not able to control the lights. I checked the log for the add on and it shows me this. GOVEE_API_KEY=REDACTEDGOVEE_MQTT_HOST=localhostGOVEE_TEMPERATURE_SCALE=CGOVEE_EMAIL=REDACTEDGOVEE_PASSWORD=REDACTEDGOVEE_MQTT_PASSWORD=REDACTEDGOVEE_MQTT_USER=addonsGOVEE_MQTT_PORT=1883++ cd /app++ exec /app/govee serve[2025-09-27T11:28:31 INFO govee::commands::serve] Starting service. version 2025.04.13-17d43d72[2025-09-27T11:28:31 INFO govee::commands::serve] Querying platform API for device list[2025-09-27T11:28:31 INFO govee::commands::serve] Querying undocumented API for device + room list https://preview.redd.it/vapukljh7qrf1.png?width=2228&amp;format=png&amp;auto=webp&amp;s=0a90394ce99207ed1375fb5faac2483d5dca8bf1 Also when I go on my devices and on MQTT add on I don't see the lights anymore, furthermore. I did try to restore my backup but it was showing me my lights but it was giving me error that the data was not being updated from the add on. Did the add on broke, or am I doing something wrong. Like is there a replacement add on I got H6008 lights.",
      "author": "TheDoctor1K01",
      "timestamp": "2025-09-27 23:34:58",
      "url": "https://reddit.com/r/homeassistant/comments/1nry8mb/govee_2_mqtt_broken/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 2,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nz2s4j",
      "title": "MQTT Broker and Containerized Home Assistant",
      "content": "For those of you out there running HA in a container and using an MQTT broker - which one are you using? I'm trying to do some Zigbee network mapping and need a broker. And, as I found out, containerized HA doesn't support Add On's (which it seems most people use). So while I twiddle my thumbs wondering if I should migrate to HAOS on bare metal, let me know which broker you're using as I can't seem to find a clear path forward. Thx",
      "author": "K_Sqrd",
      "timestamp": "2025-10-06 06:57:33",
      "url": "https://reddit.com/r/homeassistant/comments/1nz2s4j/mqtt_broker_and_containerized_home_assistant/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1lg136r",
      "title": "Make a MQTT I2C Humidity Sensor with ESP32-C6 (part 1)",
      "content": "Sorry for the bad focus. Next time I position my camera higher. Unfortunately I broke the sensor shortly after the video, so the next video will be a bit delayed. The next video will be about ultra low power... The goal of the project is to measure the outside temperature and humidity and display that on my eink-status-display.",
      "author": "rapidprototrier",
      "timestamp": "2025-06-20 18:57:45",
      "url": "https://reddit.com/r/esp32/comments/1lg136r/make_a_mqtt_i2c_humidity_sensor_with_esp32c6_part/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "esp32",
      "score": 93,
      "num_comments": 11,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nhl3u6",
      "title": "MQTT Canada questions #1",
      "content": "A few questions related to the Canadian MQTT server setup at Canadaverse. 1. When I experimented with this using the Canadian server ([mqtt.mt.gt](http://mqtt.mt.gt/) in place of the default one, I was able to weed out the flood of USA based notes and chatter, which is great. But the part about filtering by province and beyond doesn't seem to have the same effect. * If in Canada change the MQTT root topic from default msh/US to msh/CA/ {your province} eg: msh/CA/BC. Case sensitive. I set my radio to **msh/CA/NS** but I still get all of Canada, which increased my node count from 35 to 350. **Is that setting supposed to filter BOTH the nodes AND the chatter from outside the selected region?** **Can I include multiple regions by combining them like emails. e.g. msh/CA/NS ; msh/CA/NB** **Is there a list of valid regions beyond the provinces and their standard codes. e.g. Counties, Halifax, Hants** (I had to split my questions into separate posts, because the Reddit Bot removed it for some reason)",
      "author": "robvann",
      "timestamp": "2025-09-15 20:56:47",
      "url": "https://reddit.com/r/meshtasticCanada/comments/1nhl3u6/mqtt_canada_questions_1/",
      "metadata": {
        "domain": "self.meshtasticCanada",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtasticCanada",
      "score": 5,
      "num_comments": 8,
      "upvote_ratio": 0.86,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1lq2r3c",
      "title": "A fully open-source electromechanical 7‐segment display that can run completely standalone or pull in data from an API or via MQTT. It’s built around an ESP32, so all communication happens over Wi-Fi.",
      "content": "",
      "author": "Sokolsok",
      "timestamp": "2025-07-03 02:01:00",
      "url": "https://reddit.com/r/embedded/comments/1lq2r3c/a_fully_opensource_electromechanical_7segment/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "embedded",
      "score": 101,
      "num_comments": 8,
      "upvote_ratio": 0.97,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nohhet",
      "title": "Is there something I have to do to my wifi router to get it to allow MQTT traffic to and from a node?",
      "content": "I've been searching for an answer for this for a couple days but there are too many common keywords and all I'm finding are smart home results. I have a Station G2 set up at home and connected to my wifi no problem. My laptop finds it and I can run either Meshsense or the web client (but not both at the same time) and both of those work no problem. I usually leave Meshsense running and it cooks along fine. What I'd like to also be able to do is have that node uplink locations so the neighborhood shows up on meshmap.net. My pocket node does that through my phone but I'm not always around and nodes drop off. I've been messing with the settings and the G2 does all the business when connected to my phone via Bluetooth so I suspect there's some firewall setting in my router that I need to change but I'm not at all versed in that stuff. Anyone got the fix?",
      "author": "ChurchStreetImages",
      "timestamp": "2025-09-23 21:31:42",
      "url": "https://reddit.com/r/meshtastic/comments/1nohhet/is_there_something_i_have_to_do_to_my_wifi_router/",
      "metadata": {
        "domain": "self.meshtastic",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 2,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n1tu74",
      "title": "MQTT autodiscover troubleshooting. can anyone find an obvious error?",
      "content": "I have a raspberry pi reporting cpu temp and load over MQTT. I recently upgraded from HA 2025.6 to 2025.8.3 and now the CPU load is not being recognized by MQTT on HA. I'm running a separate mosquito broker, messages are being received by HA, but HA just isn't finding the CPU load when it configures the sensors. listening to mqtt in HA, topic: homeassistant/# , I see : Message 3 received on homeassistant/sensor/calendar_system_cpu_load/state at 1:59 PM: { \"cpu_load\": 56.2 } QoS: 0 - Retain: false Message 2 received on homeassistant/sensor/calendar_system_temperature/state at 1:59 PM: { \"temperature\": \"57.4\" } QoS: 0 - Retain: false Message 1 received on homeassistant/sensor/cal_system_temp_001/config at 1:59 PM: { \"name\": \"Calendar System Temperature\", \"unique_id\": \"cal_system_temp_001\", \"state_topic\": \"homeassistant/sensor/calendar_system_temperature/state\", \"unit_of_measurement\": \"°C\", \"device_class\": \"temperature\", \"value_template\": \"{{ value_json.temperature }}\", \"device\": { \"identifiers\": [ \"cal_system_sensors_001\" ], \"name\": \"System Sensors\", \"model\": \"Generic System Monitor\", \"manufacturer\": \"Custom\" } } QoS: 0 - Retain: true Message 0 received on homeassistant/sensor/cal_system_cpu_load_001/config at 1:59 PM: { \"name\": \"Calendar CPU Load\", \"unique_id\": \"cal_system_cpu_load_001\", \"state_topic\": \"homeassistant/sensor/calendar_system_cpu_load/state\", \"unit_of_measurement\": \"%\", \"device_class\": \"power\", \"value_template\": \"{{ value_json.cpu_load }}\", \"device\": { \"identifiers\": [ \"cal_system_sensors_001\" ], \"name\": \"System Sensors\", \"model\": \"Generic System Monitor\", \"manufacturer\": \"Custom\" } } QoS: 0 - Retain: true I'm sure it is something simple I'm missing, but for the life of me, I can't find it.",
      "author": "rocketdyke",
      "timestamp": "2025-08-28 05:32:42",
      "url": "https://reddit.com/r/homeassistant/comments/1n1tu74/mqtt_autodiscover_troubleshooting_can_anyone_find/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 1,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nl3gnv",
      "title": "MQTT Sensors to Switch?",
      "content": "Hello everyone, I have installed a gateway for my heating system here. It is connected between the boiler and the room thermostat. I have then integrated the gateway into Home Assistant via MQTT and the information from the heating system also comes through. However, I would now like to use the gateway to change parameters such as the hot water temperature, etc. How can I do that? The only thing that was automatically integrated as adjustable was the room temperature. I think you have to switch on the OTC function, but this is also only displayed as a sensor. How can I change this?",
      "author": "Infosucher",
      "timestamp": "2025-09-19 21:22:59",
      "url": "https://reddit.com/r/homeassistant/comments/1nl3gnv/mqtt_sensors_to_switch/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 2,
      "num_comments": 7,
      "upvote_ratio": 0.75,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n48xa4",
      "title": "(In production) Budget option for single sensor to mqtt qos2",
      "content": "Hello guys, i have a retroreflective sensor. I want to push the signal via mqtt qos 2. I want the implementation of mqtt to be reliable. Not like some arduino library that looks like it hasn‘t been touch for many years. I would prefer hardware from a company that has been around for a while. I prefer LAN over wifi. Poe would be a nice option. Best regards",
      "author": "Kuestensau",
      "timestamp": "2025-08-31 02:31:17",
      "url": "https://reddit.com/r/PLC/comments/1n48xa4/in_production_budget_option_for_single_sensor_to/",
      "metadata": {
        "domain": "self.PLC",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "PLC",
      "score": 3,
      "num_comments": 9,
      "upvote_ratio": 0.8,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nqopi2",
      "title": "MQTT failed to connect, exiting... (connack timeout)",
      "content": "Hey y'all, I've tried to set up Z2M in Docker on multiple occasions, but I continue to get this error every time. I have Mosquitto and Z2M configured in the same Docker Compose file, and I can connect to my MQTT broker just fine with MQTT Explorer. I've searched everywhere but couldn't find anything that helped. Any insight is greatly appreciated. Thanks! Z2M log with connack timout error: [2025-09-07 11:58:49] info: z2m: Logging to console, file (filename: log.log) [2025-09-07 11:58:49] info: z2m: Starting Zigbee2MQTT version 2.6.1 (commit #e9889e5d20e8911550d5231bc0349567cc2bb9ce ) [2025-09-07 11:58:49] info: z2m: Starting zigbee-herdsman (6.0.4) [2025-09-07 11:58:49] info: zh:zstack:znp: Opening TCP socket with 192.168.68.104:6638 [2025-09-07 11:58:49] info: zh:zstack:znp: Socket connected [2025-09-07 11:58:49] info: zh:zstack:znp: Socket ready [2025-09-07 11:58:49] info: zh:zstack:znp: Writing CC2530/CC2531 skip bootloader payload [2025-09-07 11:58:50] info: zh:zstack:znp: Skip bootloader for CC2652/CC1352 [2025-09-07 11:59:16] info: zh:controller: Wrote coordinator backup to '/app/data/coordinator_backup.json' [2025-09-07 11:59:17] info: z2m: zigbee-herdsman started (reset) [2025-09-07 11:59:17] info: z2m: Coordinator firmware version: '{\"meta\":{\"maintrel\":1,\"majorrel\":2,\"minorrel\":7,\"product\":1,\"revision\":20240710,\"transportrev\":2},\"type\":\"ZStack3x0\"}' [2025-09-07 11:59:17] info: z2m: Currently 0 devices are joined. [2025-09-07 11:59:17] info: z2m: Connecting to MQTT server at mqtt://192.168.68.102:1883 [2025-09-07 11:59:47] error: z2m: MQTT failed to connect, exiting... (connack timeout) [2025-09-07 11:59:47] info: z2m: Stopping zigbee-herdsman... Z2M *configuration.yaml*: version: 4 mqtt: base_topic: zigbee2mqtt server: mqtt://192.168.68.102:1883 serial: port: tcp://192.168.68.104:6638 adapter: zstack baudrate: 115200 rtscts: false advanced: log_level: info channel: 25 network_key: - 157 - 220 - 49 - 252 - 160 - 10 - 231 - 83 - 132 - 219 - 35 - 122 - 32 - 115 - 77 - 54 pan_id: 21643 ext_pan_id: - 246 - 249 - 49 - 108 - 233 - 169 - 155 - 96 frontend: enabled: true port: 8080 homeassistant: enabled: true onboarding: true *mosquitto.conf*: listener 1883 listener 9001 protocol websockets allow_anonymous true persistence true persistence_file mosquitto.db persistence_location /mosquitto/data/ log_dest file /mosquitto/log/mosquitto.log log_dest stdout log_type all Docker *compose.yaml*: mosquitto: image: eclipse-mosquitto:latest container_name: mosquitto volumes: - /opt/docker/mosquitto/config:/mosquitto/config - /opt/docker/mosquitto/data:/mosquitto/data - /opt/docker/mosquitto/log:/mosquitto/log ports: - 1883:1883 - 9001:9001 stdin_open: true tty: true zigbee2mqtt: container_name: zigbee2mqtt image: ghcr.io/koenkk/zigbee2mqtt:latest restart: unless-stopped volumes: - /opt/docker/zigbee2mqtt/data:/app/data - /run/udev:/run/udev:ro ports: # Frontend port - 8080:8080",
      "author": "WateryFries",
      "timestamp": "2025-09-26 09:37:01",
      "url": "https://reddit.com/r/Zigbee2MQTT/comments/1nqopi2/mqtt_failed_to_connect_exiting_connack_timeout/",
      "metadata": {
        "domain": "self.Zigbee2MQTT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Zigbee2MQTT",
      "score": 2,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nkaj1k",
      "title": "Any way to know when frigate successfully started with mqtt?",
      "content": "I tried: trigger: mqtt topic: frigate/available payload: online But this is triggering also when frigate is already online for a while. Help would be appriciated :)",
      "author": "borgqueenx",
      "timestamp": "2025-09-18 22:56:26",
      "url": "https://reddit.com/r/frigate_nvr/comments/1nkaj1k/any_way_to_know_when_frigate_successfully_started/",
      "metadata": {
        "domain": "self.frigate_nvr",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "frigate_nvr",
      "score": 2,
      "num_comments": 6,
      "upvote_ratio": 0.75,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nvem1a",
      "title": "Zigbee2MQTT: \"This entity is no longer being provided by the mqtt integration\" but devices work fine in Z2M",
      "content": "Hi everyone, I’m stuck with an integration issue between **Zigbee2MQTT** and **Home Assistant**. **Context:** * Zigbee2MQTT 2.6.1 with Sonoff coordinator (EZSP 7.4.5). * 87 devices paired, all visible and working fine in Z2M. * MQTT broker: core-mosquitto (HA add-on). * Home Assistant MQTT integration enabled with discovery. **Problem:** * In Zigbee2MQTT, all devices respond correctly (ON/OFF, status, etc.). * In Home Assistant, many entities show:*This entity is no longer being provided by the mqtt integration. If the entity is no longer in use, delete it in settings.* * These entities stay “dead” in HA dashboards, even though Z2M still controls them fine. **What I tried so far:** * Verified `homeassistant: enabled: true` in Z2M config. * Published `homeassistant/status → online` to MQTT to trigger discovery. * Listened to `homeassistant/#` → not seeing device `config` messages. * Tried both `force_disable_retain: true/false`. * Restarted HA + Z2M + Mosquitto multiple times. * Devices are present in Z2M frontend, but not re-discovered in HA. **So basically:** Z2M is pushing fine to MQTT, but HA doesn’t re-adopt the entities. 👉 Has anyone fixed this issue where **devices are alive in Z2M but orphaned in Home Assistant**? * Do I need to purge retained MQTT topics under `homeassistant/#`? * Or is this a known bug with recent HA/Z2M builds? Thanks a lot 🙏",
      "author": "tanjohnson99",
      "timestamp": "2025-10-02 01:28:36",
      "url": "https://reddit.com/r/Zigbee2MQTT/comments/1nvem1a/zigbee2mqtt_this_entity_is_no_longer_being/",
      "metadata": {
        "domain": "self.Zigbee2MQTT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Zigbee2MQTT",
      "score": 2,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mjam1l",
      "title": "Mqtt verification",
      "content": "Does anyone else have this if so how do I solve it because I updated everything",
      "author": "Own-Outside-2541",
      "timestamp": "2025-08-07 01:15:08",
      "url": "https://reddit.com/r/BambuLabA1mini/comments/1mjam1l/mqtt_verification/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuLabA1mini",
      "score": 2,
      "num_comments": 12,
      "upvote_ratio": 0.67,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1npitth",
      "title": "cataloging which commands require MQTT signatures?",
      "content": "Do we have a list yet of which operations require MQTT signatures? I know setting nozzle and heat bed temperature requires it. I think setting one or both of AMS filament type and K factor require it, but I'm not entirely sure. What others? Fan control? Pause/resume print? Does anyone have a \"test jig\" for testing features? What kind of response code (if any) does the printer provide if it gets an authentication failure for a signature-required MQTT command?",
      "author": "pleasantone",
      "timestamp": "2025-09-25 01:45:09",
      "url": "https://reddit.com/r/OpenBambu/comments/1npitth/cataloging_which_commands_require_mqtt_signatures/",
      "metadata": {
        "domain": "self.OpenBambu",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "OpenBambu",
      "score": 1,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nsypqg",
      "title": "Yet another MQTT question",
      "content": "Hi Meshtastic people, I'm trying to understand how network works but currently few things are not very clear to me. I want to create a Meshtastic-first service in my area, where people can connect and publish messages, and get replies (like a bot). The data they sent will be processed locally, and I already have a server for it. As far as I get it, to interface with the network I need to put a local physical node out there and somehow advertise it, maybe put stickers on a street or something, so people can find it and connect - I've read that only people with the same mesh settings can join; so for the HW I was thinking of getting a WisMesh Ethernet MQTT Gateway. Now the real question: how does MQTT play in all of this? Official Meshtastic doc mentions there's some \"Default broker\" available, does it mean that I can just connect there instead and avoid buying my local node? Does it work like TheThingsNetwork? Or MQTT is just purely for bridging Meshtastic and LAN? Edit: I'm located in the EU. Thank you!",
      "author": "SentenceSavings7018",
      "timestamp": "2025-09-29 04:27:18",
      "url": "https://reddit.com/r/meshtastic/comments/1nsypqg/yet_another_mqtt_question/",
      "metadata": {
        "domain": "self.meshtastic",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 0.8,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n6ebuf",
      "title": "HELP: Konnected board keeps rebooting every ~1000s (“No clients; rebooting”) even with MQTT connected",
      "content": "Hi all, I’m running a Konnected Alarm Panel Pro board (via PoE) and I can’t get its uptime to exceed \\~1000 seconds. When I check the web UI, I see this in the logs: [sensor:103] 'Uptime': Sending state 870.0 s [api:129] No clients; rebooting Thing is, I *do* have clients connected over **MQTT** and data is flowing fine. But it looks like the firmware is checking for **API clients** (like Home Assistant via ESPHome API) instead of MQTT clients, and since it doesn’t see one, it reboots itself. What I’ve tried so far: * Power is solid (using PoE splitter, 5V 2A). * Board works fine until it hits the reboot timeout. * MQTT connection is stable — Nodered sees the entities. * Nothing else is crashing, only this “No clients; rebooting” condition. Any guidance would be much appreciated — I just want the board to stay online with MQTT only, no API required. Thanks! EDIT: setting `reboot_timeout: 0s` under the API config (`api:`) seemed to solve the issue of rebooting. thank you u/meep185 for the support.",
      "author": "Particular-ayali",
      "timestamp": "2025-09-02 16:51:33",
      "url": "https://reddit.com/r/konnected/comments/1n6ebuf/help_konnected_board_keeps_rebooting_every_1000s/",
      "metadata": {
        "domain": "self.konnected",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "konnected",
      "score": 1,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nhkoj1",
      "title": "MQTT config question",
      "content": "I've been working on this project https://github.com/alanb128/ha-environmental-sensors Have a couple of the sensors built now, but having issues adding them to my home assistant, I followed his guide, have mosquito added to my home assistant but the next step, editing the configuration.yaml I cannot get to work, I read through the link he provided but am unsure what specifically I need to add for these sensors. Any sample code would be much appreciated.",
      "author": "Doki_Sparkles",
      "timestamp": "2025-09-15 20:38:22",
      "url": "https://reddit.com/r/homeassistant/comments/1nhkoj1/mqtt_config_question/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 1,
      "num_comments": 6,
      "upvote_ratio": 0.99,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n871jm",
      "title": "Problem conneting A1 mini and OrcaSlicer - MQTT Command verification failes",
      "content": "**Hi everyone,** I'm new to the 3D printing community and not very experienced with troubleshooting IT issues, so I’m hoping for your help. I recently bought a Bambulab A1 Mini and would like to use OrcaSlicer to send my print jobs. However, I keep encountering the error: \"MQTT Command verification fails.\" Here’s my setup: * **BambuLab A1 Mini** version [01.06.00.00](http://01.06.00.00) * **OrcaSlicer** version 2.3.0 * **Bambu Handy** version 3.6.0 Everything works perfectly fine when using Bambu Studio, with absolutely no issues. Has anyone encountered the same problem or found a solution? Thanks in advance!",
      "author": "Wrong-Introduction78",
      "timestamp": "2025-09-04 19:01:05",
      "url": "https://reddit.com/r/BambuLab/comments/1n871jm/problem_conneting_a1_mini_and_orcaslicer_mqtt/",
      "metadata": {
        "domain": "self.BambuLab",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuLab",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nldsq9",
      "title": "Does Scrypted publish to MQTT when an object is detected specifically?",
      "content": "I'm looking through everything that Scrypted is sending to my MQTT broker, but I'm not find anything that would specifically tell me when an event was recorded. Lost of motion notifications, but that's pretty noisy. Is there some way that I can use MQTT in general (or Home Assistant specifically) to know when Scrypted determined that an event actually took place?",
      "author": "OrigamiPossum",
      "timestamp": "2025-09-20 03:59:08",
      "url": "https://reddit.com/r/Scrypted/comments/1nldsq9/does_scrypted_publish_to_mqtt_when_an_object_is/",
      "metadata": {
        "domain": "self.Scrypted",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "Scrypted",
      "score": 1,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mhkta2",
      "title": "MQTT &amp; Bambu Update",
      "content": "I got this message today… “MQTT Command verification failed. Please update Studio (including the network plugin) or Handy to the latest version, then restart the software and try again.” I have avoided the software update on Studio because I’ve seen horror stories on here, but it looks like I have to now. Anyone else have experience with this? Is it safe to update the software on Studio now? Thank you for any help you can provide.",
      "author": "Triple_Dubya",
      "timestamp": "2025-08-05 02:03:08",
      "url": "https://reddit.com/r/BambuLabA1/comments/1mhkta2/mqtt_bambu_update/",
      "metadata": {
        "domain": "self.BambuLabA1",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuLabA1",
      "score": 4,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1lwidp3",
      "title": "MQTT Additional topics - Does it require reconfigure from scratch?",
      "content": "I'm importing CumulusMX data via MQTT, and MQTT Explorer shows additional topics I've added in the configuration file. Despite stopping and restarting the MQTT feed in the integration, restarting the integration itself, and even restarting HA, I can't get new ones to appear. Some old ones I removed show as no longer available in the entities list, however, so it is definitely seeing the changes. Do I have to entirely clobber the subscription on the HA MQTT Integraiton end and restart it just to have a few new entities show up? EDIT: Oddly, after a number of stops and restarts of HA, the MQTT integration, and the specific topics, they are starting to show up hours after I created them and first attempted restarting everything. Apparently they \"wonder in of their own accord\" when the get around to it like a drunk who comes home in the wee hours from a bar. I've been working on this for about 6-7 hours now, and they're still not all there, but a few show up suddenly when I look again.",
      "author": "wivaca2",
      "timestamp": "2025-07-11 01:16:20",
      "url": "https://reddit.com/r/homeassistant/comments/1lwidp3/mqtt_additional_topics_does_it_require/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 0,
      "num_comments": 15,
      "upvote_ratio": 0.5,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nhll7z",
      "title": "MQTT Question #2",
      "content": "Trying my question as an image since the Reddit robot doesn't seem like something in here. https://preview.redd.it/zlax824yvbpf1.png?width=1095&amp;format=png&amp;auto=webp&amp;s=8014c4382ac3ba0a33163153b80ae7d995f41794",
      "author": "robvann",
      "timestamp": "2025-09-15 21:17:10",
      "url": "https://reddit.com/r/meshtasticCanada/comments/1nhll7z/mqtt_question_2/",
      "metadata": {
        "domain": "self.meshtasticCanada",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtasticCanada",
      "score": 2,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mbj0wz",
      "title": "Govee MQTT or Matter control. Which is better and why?",
      "content": "Hoping to get some feedback from the community about the benefits of one versus the other and possible downsides. So far what I’ve noticed. MQTT is faster but seems to need a cool down period if I’m adjusting too much. First action is instant… second usually is too but after that, it might take about 5 to 10 seconds to change the scene or color. Also has access to the Govee effects in a drop down. Matter marginally slower but seems the most consistent speed wise. No effects down drown. I’d stick with MQTT for the speed and effects but due to its inconsistency with speed I’m not sure it’s worth it. Is the delay something that can be mitigated?",
      "author": "iametron",
      "timestamp": "2025-07-28 23:19:09",
      "url": "https://reddit.com/r/homeassistant/comments/1mbj0wz/govee_mqtt_or_matter_control_which_is_better_and/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 1,
      "num_comments": 12,
      "upvote_ratio": 0.6,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nduiqg",
      "title": "Segregate LongFast MQTT and LoRa on iOS",
      "content": "Ran a fun test today. On iOS the Default Primary Channel is unnamed but it communicates with users on the LongFast channel with the same Default Key. But you can also name a Secondary Channel as LongFast and use the same Default Key and communicate with those Public users. Why do this? Primary Channel 0 can be MQTT uplink and or downlink enabled while LongFast Channel 1 can have MQTT uplink and downlink disabled and therefore LoRa only 🤯 This allows MQTT map reporting while maintaining an otherwise dedicated LoRa focused experience. less",
      "author": "SnyderMesh",
      "timestamp": "2025-09-11 08:12:10",
      "url": "https://reddit.com/r/meshtastic/comments/1nduiqg/segregate_longfast_mqtt_and_lora_on_ios/",
      "metadata": {
        "domain": "i.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 13,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1niv9ea",
      "title": "Far away node via MQTT on node list but doesn’t appear on mesh map in app",
      "content": "Is it really at the location indicated by its node map? If it is, why does it not show on the mesh map?",
      "author": "salliesdad",
      "timestamp": "2025-09-17 06:03:15",
      "url": "https://reddit.com/r/meshtastic/comments/1niv9ea/far_away_node_via_mqtt_on_node_list_but_doesnt/",
      "metadata": {
        "domain": "self.meshtastic",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1jmmkrr",
      "title": "Real-Time Forward of Meshtastic Messages to Discord (MQTT Integration)",
      "content": "I have developed an integration to forward messages exchanged over Meshtastic to our Discord server via our MQTT server. With this integration, messages in the Meshtastic network are instantly forwarded to a designated Discord channel via MQTT and can be read from there. Thanks to this feature, individuals with internet access can perform tests on the Discord server without needing anyone else, and they do not have to enable the Store &amp; Forward feature, preventing unnecessary increases in Channel Utilization.",
      "author": "TA2DMX",
      "timestamp": "2025-03-29 21:43:48",
      "url": "https://reddit.com/r/meshtastic/comments/1jmmkrr/realtime_forward_of_meshtastic_messages_to/",
      "metadata": {
        "domain": "v.redd.it",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 86,
      "num_comments": 17,
      "upvote_ratio": 0.96,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nsm5b9",
      "title": "MQTT on a Sensecap T1000e",
      "content": "MQTT on a Sensecap T1000e Why do this? Hey, I'm from eastern Germany and still pretty new to Meshtastic tech. The map shows me a bunch of locations (well-known amateur radio pros). I've noticed for a few days now that two nodes with T1000e have popped up, but this one (picture) is the only one using LF in the whole city! All the others are in MediumSlow mode. Now I'm wondering, what are the advantages of using such a small tracker as the T 1000 in MQTT? Then internet access has to be via a cell phone because it doesn't have a TCP interface 🤔 Any answers? P.S.: Just setting up all the many functions would be too much for me :(",
      "author": "ChristopherBlues",
      "timestamp": "2025-09-28 19:39:07",
      "url": "https://reddit.com/r/meshtastic/comments/1nsm5b9/mqtt_on_a_sensecap_t1000e/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 11,
      "num_comments": 1,
      "upvote_ratio": 0.79,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1m75h7v",
      "title": "Ros 1 with Mqtt protocole",
      "content": "Hello, I am a beginner in ROS and had no prior knowledge about it. However, my PhD topic is related to ROS. When I started learning, I noticed that most tutorials and resources use the ROS Master. But in my project, I am required to work without using the ROS Master, and instead use the MQTT protocol in ROS 1. I will also be using the Gazebo simulator. My project involves multi-robot systems (Swarm Robotics). Could you please help me? -",
      "author": "TurnoverMindless6948",
      "timestamp": "2025-07-23 18:19:36",
      "url": "https://reddit.com/r/ROS/comments/1m75h7v/ros_1_with_mqtt_protocole/",
      "metadata": {
        "domain": "self.ROS",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "ROS",
      "score": 3,
      "num_comments": 11,
      "upvote_ratio": 0.8,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mimmzw",
      "title": "MQTT Command Verification Failed",
      "content": "Anyone else getting this in Handy? I’m using a brand new P1S. Firmware is up to date. I’m also using the latest versions of Handy and Studio. I also cannot read the SD card from Handy or Studio. I’m not sure if this is related. All I have found on Google is “install the latest firmware and software”. I have also tried a different SD card, formatted on the printer.",
      "author": "Relative-Studio-8584",
      "timestamp": "2025-08-06 05:55:18",
      "url": "https://reddit.com/r/BambuP1S/comments/1mimmzw/mqtt_command_verification_failed/",
      "metadata": {
        "domain": "self.BambuP1S",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "BambuP1S",
      "score": 2,
      "num_comments": 9,
      "upvote_ratio": 0.67,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1naq1x1",
      "title": "Built a Minecraft → MQTT bridge, turns out it’s really good for monitoring servers",
      "content": "",
      "author": "Front-Juggernaut9083",
      "timestamp": "2025-09-07 18:45:50",
      "url": "https://reddit.com/r/admincraft/comments/1naq1x1/built_a_minecraft_mqtt_bridge_turns_out_its/",
      "metadata": {
        "domain": "",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "admincraft",
      "score": 8,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1l7f4rh",
      "title": "Ecowitt Gateway directly to MQTT",
      "content": "I just got an ecowitt gw2000, ws90, and wh57. Ecowitt has a native integration. But I can't use it because my HA has TLS. In January Ecowitt enabled MQTT as an option. Now I don't need an addon like ecowitt2mqtt. But it's a messy output they give and it had to be cleaned up. I used gemini to output something and then had to continue to edit the yaml to get to to work properly. I'm very happy with the results. I'll post the code in the comments.",
      "author": "crazifyngers",
      "timestamp": "2025-06-10 04:12:11",
      "url": "https://reddit.com/r/homeassistant/comments/1l7f4rh/ecowitt_gateway_directly_to_mqtt/",
      "metadata": {
        "domain": "reddit.com",
        "is_self": false,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 7,
      "num_comments": 16,
      "upvote_ratio": 0.78,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mj7739",
      "title": "MQTT Broker + Nodes: End-to-End Tutorial?",
      "content": "I have casually been playing around with setting up a broker (I’ve been playing with Mosquitto) and trying to get Client nodes to connect and relay. I have been trying to find a really good end-to-end step-by-step tutorial with detailed explanations at what is happening at each step. Does one of these exist? A little more context: this is for geographically-disparate nodes that you can’t mesh such as home to an office 30 miles away over flat land. I’m planning on prototyping the broker on a RPi. I have a Real(TM) IP address block routed to my house so I don’t have to do NAT passthroughs (not that it matters). Then when I’m at the office, I can connect to carry-nodes at the house and vice versa.",
      "author": "allengwinn",
      "timestamp": "2025-08-06 23:07:48",
      "url": "https://reddit.com/r/meshtastic/comments/1mj7739/mqtt_broker_nodes_endtoend_tutorial/",
      "metadata": {
        "domain": "self.meshtastic",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 9,
      "num_comments": 8,
      "upvote_ratio": 0.92,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nq32ga",
      "title": "RF sensor via C1101 to MQTT",
      "content": "I was planning to do it a while ago/.. Ordered sensors, not forgot what the big plan was. (had some project link on hand which I lost). I need to read wireless weather station(s) an send data to MQTT, I have C1101 on my table (868 and 433), I would like to use ESP8622/ESP32. Where do I start?",
      "author": "Background_Wrangler5",
      "timestamp": "2025-09-25 18:24:18",
      "url": "https://reddit.com/r/homeassistant/comments/1nq32ga/rf_sensor_via_c1101_to_mqtt/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 1,
      "num_comments": 2,
      "upvote_ratio": 0.67,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1lzmc1r",
      "title": "PSA: [UK] The smart energy CAD with local MQTT support, Glow, is back in stock in 2 days",
      "content": "https://shop.glowmarkt.com/products/display-and-cad-combined-for-smart-meter-customers I’ve already got mine and couldn’t be happier. Elec &amp; gas reported to my local MQTT server, simple as that. I’ve got a zero cloud policy for my household and it was the only one that fitted the bill They are seemingly perpetually out of stock so once I got whiff of the restock, I thought maybe someone here will be interested! N.B.: Not affiliated with them in any way",
      "author": "Nihlus89",
      "timestamp": "2025-07-14 21:25:27",
      "url": "https://reddit.com/r/homeassistant/comments/1lzmc1r/psa_uk_the_smart_energy_cad_with_local_mqtt/",
      "metadata": {
        "domain": "self.homeassistant",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "homeassistant",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 0.68,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nvjikk",
      "title": "Discord and MQTT for Low Country Mesh Users",
      "content": "Hey Everyone, If you have spent any time in the Low Country with meshtastic, finding people can be hit or miss. Currently a group of us (Primary in Charleston) have put a discord together and are testing a MQTT chat for the Low County area. Feel free to join if your interested, hoping to build out a bigger network here soon to reach more people. Discord: [https://discord.gg/ASRF8KN9x5](https://discord.gg/ASRF8KN9x5) MQTT: [https://meshtastic.org/e/?add=true#Ci8SIJ6LQ0niNNADRmvo07sNkHN1wHFXjk5gmos0skMDVHXVGglMb1JvLU1lc2goARIMCAE4AUAFSAFQHmgB](https://meshtastic.org/e/?add=true#Ci8SIJ6LQ0niNNADRmvo07sNkHN1wHFXjk5gmos0skMDVHXVGglMb1JvLU1lc2goARIMCAE4AUAFSAFQHmgB)",
      "author": "WorthCucumber8870",
      "timestamp": "2025-10-02 04:27:23",
      "url": "https://reddit.com/r/CharlestonMeshOps/comments/1nvjikk/discord_and_mqtt_for_low_country_mesh_users/",
      "metadata": {
        "domain": "self.CharlestonMeshOps",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "CharlestonMeshOps",
      "score": 2,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n4o6ez",
      "title": "a good c++ library to insert json data from MQTT broker into MySQL database?",
      "content": "I found [this](https://github.com/FragJage/MqttMySQL/tree/main) one, but it doesn't seem to support json strings? So, if anyone knows, there's an ESP32 module, containing microcontroller, wi-fi chip etc. It'll send sensor data as json to MQTT broker using [this](https://github.com/knolleary/pubsubclient) library, so the json string will look like this: {\"sn\":\"A1\",\"flow\":6574,\"tds\":48,\"temp\":25,\"valve\":\"open\",\"status\":1} sn = serial number of each device. Sometimes, if a command is sent to the device from mqtt broker, device can return an information about itself, it'll append a \"debug\" key into json string, so json will end up looking like this: {\"sn\":\"A1\",\"flow\":6574,\"tds\":48,\"temp\":25,\"valve\":\"open\",\"status\":1, \"debug\":\"\\[I20\\]free heap: 10000\"} Now each device will be sending such data every 1 sec, so I need a solution that will send to queue buffer, so as to not to get overwhelmed. Imagine 50K of devices each sending every 1 sec? So I was wondering, why reinvent the wheel, when what I need - is quite common, so someone probably already has a premade library in github/whenever, so I was wondering if someone could help me here. I know C as a strong junior, and C++ as a beginner. I also know there are plenty of premade scripts for Python, but I don't know python. I'd prefer in C++ because then at least I'd be able to modify the code, and choose into which columns and tables to have the data stored.",
      "author": "KernelNox",
      "timestamp": "2025-08-31 15:06:41",
      "url": "https://reddit.com/r/cpp_questions/comments/1n4o6ez/a_good_c_library_to_insert_json_data_from_mqtt/",
      "metadata": {
        "domain": "self.cpp_questions",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "cpp_questions",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 0.87,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nhlen5",
      "title": "MQTT Question #3",
      "content": "3) APRS sounds interesting as a way to transmit weather data to multiple people at the same time. But I am not a ham (yet), so I am not clear about WHO this goes to. **Does a message originating from a Mesh radio go to the broader ham network if you send a message in the common channel 0 to VE3YBN-13 ?** * Sending message in format APRS-VE3XXX: your message here inside mesh will deliver it to VE3XXX . Sending message via APRS to VE3YBN-13 will deliver it to \\^all (I had to split my questions into separate posts, because the Reddit Bot removed it for some reason)",
      "author": "robvann",
      "timestamp": "2025-09-15 21:09:18",
      "url": "https://reddit.com/r/meshtasticCanada/comments/1nhlen5/mqtt_question_3/",
      "metadata": {
        "domain": "self.meshtasticCanada",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtasticCanada",
      "score": 2,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nr6scy",
      "title": "Looking for help diagnosing MQTT forwarding for a multi-state family mesh",
      "content": "**Context** * Three channels on Meshtastic: 1. Family (private, multi-state, intended to bridge via MQTT) 2. Local Mesh 3. LongFast (default) * Each channel has its own PSK. * Using HiveMQ Cloud as the broker. * Goal is a cloud solution so an outage at my location does not take everyone down. **Problem** Messages from the Family channel rarely reach the MQTT broker. I occasionally see one arrive, but most do not. I want to confirm the required settings and what I might be missing. **What I have done** * Created the HiveMQ instance and credentials. * Configured MQTT settings on the Family channel. * Searched through forum posts and MQTT threads but did not find a fix. **What I need** A checklist of required settings and common pitfalls for getting consistent MQTT uplink/downlink on a private channel across multiple states. If there are known gotchas with channel-level MQTT toggles, topic formats, ACLs, TLS ports, client IDs, or per-node roles, please call those out. **Details you may want me to provide** * Firmware versions for each node - 2.6.11 * Exact MQTT settings (server, port, TLS, root topic, client ID, username/password) - default port, using the TLS URL * Whether nodes have Wi-Fi or phone tether for internet, and which one is the MQTT gateway - testing with Heltec, lilygo nodes via bluetooth. I have a station G2 but its is not up at the moment, it will be about 65' up on a tower and be on wifi when it goes up. * Any routing or hop settings that could affect forwarding? * Any limitations to the URL length? Thanks in advance for any pointers or a known-good baseline config for this setup.",
      "author": "MoGMRS",
      "timestamp": "2025-09-27 01:01:41",
      "url": "https://reddit.com/r/meshtastic/comments/1nr6scy/looking_for_help_diagnosing_mqtt_forwarding_for_a/",
      "metadata": {
        "domain": "self.meshtastic",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "meshtastic",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nv9jh1",
      "title": "Confused about how APIs work in real projects (IoT / Flutter / webdev)",
      "content": "Hi everyone, I’m an IoT major and I’ve built some small projects with Flutter for the frontend and Python for backend processing (like photo processing). So far, I’ve always just stored files locally (in a folder), then hard-coded the path, and let Flutter call the Python script directly. Repo (for reference): [https://github.com/Mahmoudbat/2d-cnc-printer](https://github.com/Mahmoudbat/2d-cnc-printer) But I realize this isn’t how things are done in the industry. From what I understand, people use **APIs** to communicate between frontend and backend. I tried to look into APIs but I got lost — there are so many (REST, GraphQL, WebSockets, MQTT, etc.). Here’s where I’m stuck: * Are APIs basically just a way to transfer messages, like TCP/UDP already do? * If so, why not just use TCP or UDP directly? * I see frameworks like FastAPI, Django, Flask — do they all just implement REST under the hood? * Is an “API” just a concept, while the framework decides how it’s actually implemented? For context: I’m joining a hackathon soon, and I need to process an image on my machine (Python) and represent it on a webpage (frontend). I’d love if someone could explain in beginner-friendly terms (with maybe a small example flow) how to structure this for a real-world project. Thanks in advance!",
      "author": "IMLE9",
      "timestamp": "2025-10-01 22:21:20",
      "url": "https://reddit.com/r/IOT/comments/1nv9jh1/confused_about_how_apis_work_in_real_projects_iot/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 4,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nszvls",
      "title": "Need help figuring out moisture water sensors.",
      "content": "So I want to have some flower pots with moisture sensors, that I’m able to output through wifi to a IIot dashboard based of mqtt or raw http. What ever works. I’ve been researching but I don’t know what to use. The sensors I found the gateways only connect to one sensor.",
      "author": "Alexrak2",
      "timestamp": "2025-09-29 05:14:29",
      "url": "https://reddit.com/r/IOT/comments/1nszvls/need_help_figuring_out_moisture_water_sensors/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 2,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nmel4n",
      "title": "ESP8266 + SIM900 GPS Tracker with Flask + Leaflet Map UI",
      "content": "Hey folks, I’ve been working on a little IoT project that combines two **ESP8266 boards, a GPS module, and a SIM900 GSM modem** to track vehicle location and display it on a live map. Thought I’d share the build since it came together nicely! # 🔧 What it does * **Sender Node (ESP8266 + NEO-6M GPS):** reads latitude/longitude + timestamp and broadcasts it over a mesh network. * **Receiver Node (ESP8266 + SIM900):** receives that data, then forwards it to a Flask server via GPRS (HTTP POST). * **Flask Server:** stores incoming coordinates and serves them as JSON. * **Leaflet Map (index.html):** pulls the stored route and plots it with markers + time filters. # 📂 Repo Full code + schematics are on GitHub here: 👉 [GitHub Repo – esp8266-gps-tracker](https://github.com/alec-kr/esp8266-gps-tracker/tree/main) I’d love feedback on: * Improving the mesh receiver logic. * Best practices for handling SIM900 power brownouts. * Other ideas for expanding this (MQTT broker, logging to a database, etc). Thanks for checking it out! # 🖼 Screenshot of the front-end * Map UI showing GPS points + timestamps * Time filtering between 12:00–14:00 highlights only the journey segment https://preview.redd.it/mrpkzmy82fqf1.png?width=1025&amp;format=png&amp;auto=webp&amp;s=b2d50c18110e4b9d9cc3caa00cebc8f674b66dbb",
      "author": "storman121",
      "timestamp": "2025-09-21 08:54:51",
      "url": "https://reddit.com/r/IOT/comments/1nmel4n/esp8266_sim900_gps_tracker_with_flask_leaflet_map/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 9,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nfka81",
      "title": "Running Python + YOLO inside an MQTT broker (Documenting Systems as Code)",
      "content": "https://i.redd.it/xtjo8r2iytof1.gif I’ve been experimenting with more complex **Language of Things (LOT)** , examples.... With LOT, the Coreflux MQTT broker has a way to use the real time data like SQL is for a DATABASE. It leaves the concept of just a data pipe — it becomes a place where you can: * Transform and aggregate data in real time * Trigger and call functions scripts and AI models directly * Document the full logic in a **LOT Notebook** Usually with integrations it becomes a problem, not having all the infomration . The concept is having everything in once place, documentation and code. You would expect that to happen with a nodeJS project, but usually that is not the case. THis instead focus on the document first and the code represents usually 30% of the document. The languague abstracts most of the code into simpler instructions, useful for data flows, transformations, shcema usages , time event triggered actions, integrations with APIS, Devices and much more — everything is in one place, executable and self-documented. Instead of drawing diagrams in Confluence and coding microservices separately, the system and the document are one thing. In this case, i am trying out the VIdeo Route. And in this demo: 1. A camera in Australia streams images into MQTT 2)LOT triggers Python running **YOLO AI** for boat detection 2. The results are published back into MQTT This approach feels more **monolithic** than the usual microservice sprawl — but it’s easier to maintain, transparent, and faster to adapt. Disclaimer, I usally use Coreflux for integrations in the manufacturing industry so that is why iI have information and I work closely with the company. nevertheless decided to show this...",
      "author": "Front-Juggernaut9083",
      "timestamp": "2025-09-13 09:03:42",
      "url": "https://reddit.com/r/IOT/comments/1nfka81/running_python_yolo_inside_an_mqtt_broker/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 0.83,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1neal4h",
      "title": "Cloud vs networking: what’s worth focusing on?",
      "content": "Hi everyone, I’ve been thinking about the future of IT and technical skills. Over the past few years, cloud has been at the center of everything, but I’m wondering if in the mid-term it might lose some of its appeal, or if it will remain the main skill to focus on. In your opinion, what makes more sense to invest in: * building strong networking fundamentals (routing, switching, TCP/IP) * pursuing certifications like Cisco CCNA * or diving into IoT-related protocols and technologies such as MQTT, LoRaWAN, and telecom in general? I’d love to hear from people already working in the field or who have recently made these choices. What’s the best approach to avoid putting all my bets only on cloud? Thanks in advance for your insights!",
      "author": "ProduceInevitable957",
      "timestamp": "2025-09-11 22:38:53",
      "url": "https://reddit.com/r/IOT/comments/1neal4h/cloud_vs_networking_whats_worth_focusing_on/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 0.86,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1nd4kbb",
      "title": "Making voice AI actually conversational requires rethinking the entire flow",
      "content": "Built voice control for our smart home devices that actually understands context and doesn't need wake words for everything. THE PROBLEM: Traditional IoT voice control is basically shouting commands at devices. \"Alexa, turn on living room lights.\" \"OK Google, set temperature to 72.\" It's functional but nobody wants to talk to their house like that constantly. WHAT ACTUALLY WORKS: Made the devices understand conversational context. Walk into a room and say \"too bright\" and it dims. Say \"actually a bit more\" and it adjusts. No wake words, no specific command syntax, just natural speech. The key was moving processing to the edge. Each device runs a lightweight model that understands context from the room it's in. Kitchen device knows \"start the timer\" means oven timer. Bedroom device knows \"too cold\" means adjust thermostat. IMPLEMENTATION: - Local wake word detection on ESP32 - Streaming audio to edge server on premises - Small LLM (3B params) running on local GPU - Device control via MQTT - Using agora for audio transport when controlling remotely The remote control part was interesting. When you're away from home, the app streams your voice commands through WebRTC to your local network, processes them on your edge server, then controls devices. Keeps everything private, no cloud dependency. Latency is around 200ms for local commands, 400ms for remote. Power consumption increased by about 15% per device but worth it for the natural interaction. Biggest surprise was how much context matters. The same command means different things in different rooms at different times. \"Turn it off\" at night in bedroom means lights. Same command in kitchen during cooking means timer. Anyone else working on conversational IoT? What's your approach to context awareness?",
      "author": "anikeithkumar",
      "timestamp": "2025-09-10 12:16:12",
      "url": "https://reddit.com/r/IOT/comments/1nd4kbb/making_voice_ai_actually_conversational_requires/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 10,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1n2ov25",
      "title": "[DEMO] Smart Buildings powered by SparkplugB, Aklivity Zilla, and Kafka",
      "content": "This [**DEMO**](https://github.com/aklivity/zilla-demos/tree/main/smart-buildings) showcases a Smart Building Industrial IoT (IIoT) architecture powered by SparkplugB MQTT, Zilla, and Apache Kafka to deliver real-time data streaming and visualization. Sensor-equipped devices in multiple buildings transmit data to SparkplugB Edge of Network (EoN) nodes, which forward it via MQTT to Zilla. Zilla bridges these MQTT streams to Kafka, enabling downstream integration with Node-RED, InfluxDB, and Grafana for processing, storage, and visualization. https://preview.redd.it/xqd0dyvrttlf1.png?width=1600&amp;format=png&amp;auto=webp&amp;s=22193886003e966a8865ba2ef13a2a34f3a18a5b There's also a [**BLOG**](https://www.aklivity.io/post/fourth-industrial-revolution-industry-4-0-enabling-iiot-with-real-time-data-products) that adds additional color to the use case.",
      "author": "jkriket",
      "timestamp": "2025-08-29 05:28:48",
      "url": "https://reddit.com/r/IOT/comments/1n2ov25/demo_smart_buildings_powered_by_sparkplugb/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "is_self": true
    },
    {
      "platform": "reddit",
      "post_id": "1mxdkh9",
      "title": "looking for a bridge/gateway(?) for android device",
      "content": "im looking for an android app that takes sensor data from beacons/devices and stream it through http/mqtt does such thing exist?",
      "author": "mohammacl",
      "timestamp": "2025-08-23 01:58:06",
      "url": "https://reddit.com/r/IOT/comments/1mxdkh9/looking_for_a_bridgegateway_for_android_device/",
      "metadata": {
        "domain": "self.IOT",
        "is_self": true,
        "over_18": false,
        "spoiler": false,
        "stickied": false
      },
      "subreddit": "IOT",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "is_self": true
    }
  ],
  "collection_time": "2025-10-06T11:54:52.353476",
  "keyword": "mqtt",
  "exact_match": true
}